[{"company":"UpCode Academy","jd":"\n\n### We are looking for a Data Scientist to teach our full time class:\n\nOur Data Science course is a life-changing educational experience where\nstudents leave with the skills and mindset to take on new careers in a wide\nvariety of Data Science roles. We are looking for an instructor to spearhead\nour students' transformation through teaching and training.\n\n### Why Teach at UpCode Academy?\n\nIf you are looking to make a life-changing impact by doing what you know and\nlove, this is the position for you. Through this unparalleled opportunity, you\nwill:\n\n  * Deepen your own skills by guiding students through a rigorous journey where they begin as driven novices and leave as empowered data analysts and scientists\n  * Contribute your own expertise to a deep and lasting impact on students across multiple industries\n  * Facilitate a supportive and energetic community that lasts well beyond the course\n  * Hone your own leadership skills by working with an instructional team and classroom community\n\n<div>\n\n### What Do You Need?\n\nYou will need to show competency and understanding of the following concepts:\n\n  * Deep Learning \/ Neural Networks (MLP's, CNN's, RNN's)\n  * Regression analysis\n  * K-Means Clustering\n  * Principal Component Analysis\n  * Train\/Test and cross validation\n  * Bayesian Methods\n  * Decision Trees and Random Forests\n  * Multivariate Regression\n  * Multi-Level Models\n  * Support Vector Machines\n  * Reinforcement Learning\n  * Collaborative Filtering\n  * K-Nearest Neighbor\n  * Bias\/Variance Tradeoff\n  * Ensemble Learning\n  * Term Frequency \/ Inverse Document Frequency\n  * Experimental Design and A\/B Tests\n\n<\/div>\n\n","job_title":"Full Time Data Science Instructor","salary":"SGD 4800 - 6200  (BASIC)"},{"company":"Haulio","jd":"\n\nAs a member of Haulio’s Business Analyst team, you will help to drive the\nanalysis for company projects and strategic priorities, innovation and\noptimize our operations, and evaluate our financial performance.\n\nResponsibilities:\n\n  * Drive analysis and analytics on company projects and strategic priorities\n\n  * Develop analytical frameworks to support the company in capturing new opportunities and developing new products\n\n  * Identify operational weaknesses and help to improve or innovate new processes to keep business operations as efficient as possible\n\n  * Develop and maintain financial models to analyze company’s financial performance\n\n  * Conduct research on the container and freight industry to identify opportunities and threats\n\n  * Coordinate and collaborate with cross-functional teams from customer service to accounts to ensure alignment to company priorities\n\nRequirements:\n\n  * Bachelor’s degree in engineering, computer science, business analytics, economics, or business-related fields. Proficiency with statistics preferred.\n\n  * Curious and analytical mind that can make use of data to segment customers and generate insights\n\n  * Balances attention to detail with swift execution – we do things quickly, and we need to do them well\n\n  * Self-starter who is able to work independently and flexibly\n\n  * Proficiency in BI tools (e.g. Qlik, Tableau) to visualize data in a compelling manner\n\n  * Exceptional skills with Microsoft Excel and MS Office SuiteAs a member of Haulio’s Business Analyst team, you will help to drive the analysis for company projects and strategic priorities, innovation and optimize our operations, and evaluate our financial performance. \n\n","job_title":"Business Analyst \/ Data Analyst","salary":"1 <span>vacancy<\/span>"},{"company":"JustAnalytics","jd":"\n\nJust Analytics is hiring (Senior) Data Engineer!\n\nJust Analytics is a specialized partner providing consulting and advisory\nservices that allow our clients to meet current and future analytical goals\nand objectives. Based in Singapore, we strive to help companies build\napplications that transform data into insight giving them a greater\nunderstanding of their information assets.\n\nYour Day to Day Tasks\n\n  * Collaborate with customer to gather requirements and to understand their business processes.\n\n  * Propose and design solutions to improve existing business processes, and to help meet their business goals and targets.\n\n  * Develop system design and architecture.\n\n  * Collect, cleanse and transform data.\n\n  * Integrate data from multiple sources for report generation, visualization or to make this data accessible through web services APIs.\n\n  * Implement data analysis and machine learning algorithms to conduct hypothesis testing and to evaluate the effectiveness of the proposed solutions.\n\n  * Use tools to deploy and monitor the performance of the systems in production.\n\nMicrosoft Data Platform Engineer\n\n  * Strong understanding of data warehouse fundamentals including Data Modeling, Data management and handling of typical issues faced in large volume data warehouse development.\n\n  * Hands-on working experience on developing data warehouse solutions using Microsoft data platform.\n\n  * Minimum 3+ years’ experience with Microsoft Data platform including SQL server, Analysis services tabular models and SSIS.\n\n  * Experienced in developing ETL processes using TSQL or SSIS.\n\n  * Strong understanding and a working knowledge of Azure Services such as ADF, Azure SQL warehouse, Azure Analysis services and Power BI.\n\nGeneral Requirements\n\n  * Superior stakeholder management and helps the team to collect the requirements\/help to fine tune the requirements\n\n  * Logical thinking and willingness to take on e2e process including data modeling, data engineering and visualization.\n\n  * Strong design background and experience of designing and implementing solutions that have remained scalable\/ robust months\/ years after they were first implemented.\n\n  * Willingness to mentor and coach junior team members in the art of data science and the science of data engineering.\n\nQUALIFICATIONS\n\n  * Diploma or Bachelor Degree in relevant stream\n\n  * Only to Singaporeans or PR\n\n","job_title":"(Senior) Data Engineer ","salary":"SGD 5500 - 7500  (BASIC)"},{"company":"Talenta Pte Ltd","jd":"\n\nAvailability\n\n• Immediate preferred\n\n  \n\nJobscope\n\n• Design and development of blockchain infrastructure\n\n• Design and development of cloud computing architecture\n\n• Active research into artificial intelligence\n\n• Other miscellaneous tasks\n\n  \n\n  \n\nRequirements for Candidate\n\n• Fluency in English and Chinese as our clients speak either English or\nChinese\n\n• Knowledge and experience with blockchain, ICO process, and related\ntechnology is a plus.\n\n• Able to work effectively under demanding situations\n\n• Experience in software engineering \/ related\n\n• Strong passion for work and life. Strong entrepreneurship--That is the\ncompany culture.\n\n• Willing to learn new things fast.\n\n  \n\nWhy join us?\n\n• A superb learning opportunity at the forefront of the technology space.\n\n• Opportunity for a highly accelerated career path.\n\n• Opportunity to run a core initiative of the company and be a corporate\nleader in a short time.\n\n• Opportunity to meet highly influential people (including CEOs and\nBillionaires) through our own social events.\n\n  \n\nApplication Process\n\nPlease email your CV to us at hr@talentagroup.com\n\nIn your CV or cover letter, please include the following points:\n\n• Your experience with ICO, cryptocurrency and blockchain, if any.\n\n• Your portfolio.\n\n• Your availability.\n\n• Your citizenship (Employment Pass requirements)\n\n","job_title":"Software Engineer","salary":"1 <span>vacancy<\/span>"},{"company":"Maltem Singapore","jd":"\n\nHey there! Ready to work in a start-up environment for the Singapore entity of\nour International Group? Yes? Awesome!Maltem is THE company devoted to\ninnovation and challenging projects in IT & business environments. We are\ndriven by dynamic recruiting processes, full blown Agile Methodology on\nprojects while remaining connected to the latest digital novelties and putting\nhuman capital on the forefront. Maltem operates in 10 countries with over 1000\nemployees spanning across our 5 pillars: Innovative Concepts, Design Thinking,\nWeb & Mobile development, Agile, Banking & Insurance. Now, let’s get down to\nbusiness! These are the missions you will be entrusted with as a Cognos\nProject Manager:\n\n  * Manage and translate business requirements into strategic technical solutions,\n\n  * Design and develop new BI applications, such as debugging, adding new querying tools, platform\/data\n\n  * Integrate data from various sources to identify and resolve inconsistencies between IT systems,\n\n  * Provide visibility of Cognos Business Intelligence, including design, development, implementation and maintenance of data and reporting tools\n\n  * Coordinate project management activities, resources, equipment and information\n\n","job_title":"IT Project Manager (Cognos)","salary":"SGD 3500 - 5000  (BASIC)"},{"company":"Maltem Singapore","jd":"\n\nHey there! Ready to work in a start-up environment for the Singapore entity of\nour International Group? Yes? Awesome!Maltem is THE company devoted to\ninnovation and challenging projects in IT & business environments. We are\ndriven by dynamic recruiting processes, full blown Agile Methodology on\nprojects while remaining connected to the latest digital novelties and putting\nhuman capital on the forefront. Maltem operates in 10 countries with over 1000\nemployees spanning across our 5 pillars: Innovative Concepts, Design Thinking,\nWeb & Mobile development, Agile, Banking & Insurance. Now, let’s get down to\nbusiness! These are the missions you will be entrusted with as a Tableau\nReport Designer:\n\n  * Proficient in SQL,\n\n  * Manage Data Warehouse,\n\n  * Manage and translate business requirements into strategic technical solutions,\n\n  * Design and develop new BI applications, such as debugging, adding new querying tools, platform\/data\n\n  * Integrate data from various sources to identify and resolve inconsistencies between IT systems,\n\n  * Provide visibility using design, development, implementation and maintenance of data and reporting tools\n\n  * Coordinate project management activities, resources, equipment and information\n\n","job_title":"Report Designer (Tableau)","salary":"SGD 3500 - 5000  (BASIC)"},{"company":"Fundnel Pte Ltd","jd":"\n\nWe're looking for analytical and passionate people to join our proven team as\nHead, Data Analytics based in Singapore.\n\nRoles & Responsibilities\n\n  * Oversee and lead the development of the Deal Management System (our proprietary data-driven platform for screening and management of investments); structure and link databases, formalise and implement data collection systems, data analytics pertaining to platform metrics and financial data that we collect in the process of taking on investments, and other strategies that optimise statistical efficiency and quality\n\n  * Interpret data, analyse results using statistical techniques, identify trends and patterns in complex data sets, and provide ongoing deal analytics reports to support investment decisions\n\n  * Contribute to data mining architectures, modelling standards, reporting, and data analysis methodologies\n\n  * Collaborate with unit managers, end users, development staff, and other stakeholders to integrate Deal Management System and Analytics within existing systems\n\n  * Process, cleanse, and verify the integrity of data used for analysis\n\n  * Identify and define new process optimisation opportunities\n\n  * Provide timely information and insights regarding customers, markets, and campaign effectiveness, to measure performance and support business decisions for product development and marketing enhancement\n\n  * Implementation and maintenance of web analytics tracking tools (i.e. Adobe Analytics\/DTM and Google Analytics\/GTM) to aid in collection of web analytics data\n\n  * Able to gather insights from offline and online traffic sources to aid in marketing efforts\n\n  * Retrieval, monitoring, and analysis of all web analytics metrics to gain insights to support the marketing team with testing, decision making and further optimisation\n\n  * Improving the understanding of the customer's web behaviour and optimising the web experience through opportunity identification in tandem with the UX \/ UI team\n\n  * Leading the CRM system used to collect and track customers on the Fundnel platform\n\n  * Maintenance of CRM tool – internally with the team and externally with vendors\n\n  * Oversee tech implementations for collection of customer data\n\n  * Process, cleanse, and verify the integrity of data used for analysis in CRM tool\n\n  * Extraction of data for KPI reporting and analysis\n\n  * Targeting customers using relevant customer activity\/data sources through CRM tool\n\n  * Managerial role over the data management team (including hiring and monitoring the team)\n\n  * 3rd party vendor management and integration for various analytics tools used across platforms\n\n  \n\nSkills & Experience Required\n\n  * 4+ years of experience\n\n  * Strong experience with implementation of marketing analytics, tracking code and tag integration\n\n  * Experience using Adobe Analytics, DTM, Google Analytics, GTM\n\n  * Familiar with A-B \/ MVT testing\n\n  * Data Visualisation experience\n\n  * Strong analytical skills with the ability to collect, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy\n\n  * Good applied statistics skills, such as distributions, statistical testing, regression, etc.\n\n  * Technical expertise regarding data models, database design development, data mining and segmentation\n\n  * Proficiency in Microsoft Office\n\n  * Preference for Candidates with an understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.\n\n  * A Diploma or Degree in Mathematics, Economics, Computer Science, Information Management or Statistics\n\n  \n\nThe ideal candidate should be\n\n  * Interested in dealing with data, including finding and exploring more efficient ways\/programs (e.g. machine learning) to collect, store, and analyse data\n\n  * Able to provide thought leadership in web\/product analytics\n\n  * Preferably have some understanding of terms in financial statements and financial ratios\n\n  * Part of a product team working across various product domains with a focus on optimization of product through KPI's and metrics\n\n","job_title":"Head, Data Analytics","salary":"SGD 5000 - 10000  (BASIC)"},{"company":"MoolahSense Private Limited","jd":"\n\nThe Opportunity\n\nYou're a wizard who is good with numbers! You disdain inefficiency and you're\nobsessed with fresh insights. The tools are in your code. You manipulate Excel\nand other statistical tools like R, Python and SQL with ease. Here's a\ntraining ground to make science out of data.\n\nJob Description\n\n\\- Collect data from different business functions and track relevant metrics\nrelated to performance and efficiency\n\n\\- Design, prepare and review reports on the business performance across\nfunctions, and gather insights based on data analytics.\n\n\\- Understand database schema to identify and extract essential data to create\nvalue-added reports.\n\n\\- Develop models using statistics and business rules to identify historical\ntrends and predict future outlook.\n\n\\- Perform testing and validation of models using statistical methods to\nestablish confidence levels.\n\n\\- Perform market research and collect external data points to augment data\nanalysis.\n\n· Manage and maintain existing dashboards \/ reports and develop new dashboards\n\/ reports for business decisions with a strong focus on business intelligence\nreports for customers.\n\n· Preparing ad-hoc reports for (top) management.\n\n· Turning data into business insights \/ knowledge for business growth\nopportunity.\n\n· Create and maintain a comprehensive, effective and customized reporting\nstructure \/ process framework for future analytical use in order to support\ndecision making.\n\n· Contribute to data processing and quality improvement in all data sources\nand identifying solutions to transform manual data tasks into machine-based\nsolutions.\n\n· Identify data gaps, and provide solutions to how we can fill these gaps.\n\n  \n\nRequirements\n\n\\- Strong interest in FinTech startups.\n\n\\- University degree or above information systems, computer sciences,\nstatistics, business administration or related discipline.\n\n\\- Min. 1-3 years of data analytics experience (could be internships, school\nprojects, own ventures, etc.).\n\n\\- Strong analytical skills and statistical\/ mathematical knowledge, with\nproven ability to present and communicate analysis in a visual manner (charts)\nto management and be able to deep dive into the data sets if required\n\n\\- Possess a keen attention to detail\n\n\\- Self-starter who can handle being able to make sense of situations when\nguidance is not as abundant.\n\n\\- Financial knowledge is a plus\n\n","job_title":"Data Science, Associate ","salary":"SGD 2800 - 3500  (BASIC)"},{"company":"Aimazing","jd":"\n\nWhy you'll want this job:\n\nIn this role, you will shape the future of Aimazing Singapore. You'll work\nwith management team to define how KYC should better serve mid-market and\nenterprise customers and also shape how our products can work together to\nbecome a more seamless, unified experience.\n\nYou'll understand user behavior and expectations through customer engagement,\nresearch, and diving deep into quantitative data.\n\nYou'll synthesize customer input and technical considerations to define a\ntactical plan and long term vision for Chat\n\nYou will define, own, and optimize KPIs for the product and for the specific\nareas you own\n\nYou will define product roadmaps to ensure that we are always meeting or\nexceeding the expectations of our largest enterprise and continuing to support\nour smallest SME customers.\n\n  \n\nWhat you bring to the role:\n\nAbove all else, a deep intuition and passion for product and for delivering\npeople-centric solutions\n\nProven experience delivering phenomenal user experiences, ideally for b2b\nproducts\n\nMinimum 2 years product management experience, or equivalent experience in\nanother role; product responsibility must have included UI ownership\n\nExperience gathering, analyzing, and translating market and customer needs\ninto product requirements and prioritizing them based on solving for various,\npotentially competing outcomes\n\nProven experience delivering lo-fi product concepts, including ability to\nvisually communicate your ideas through paper sketches, Balsamiq, Sketch, or\nother methods\n\nAnalytical mindset with a passion for data-driven decision making\n\nA willingness to present and defend your ideas to key team members, including\npartners and customers\n\n","job_title":"Product Manager","salary":"SGD 3000 - 5000  (BASIC)"},{"company":"Aspire Financial Technologies","jd":"\n\nASPIRE CREDIT RISK As a credit risk analyst, you will contribute to the\nproprietary credit engine, a core component of our business. You work cross-\nfunctionally with Aspire product and technology to innovate and revolutionize\nprocesses. Help us prove that quality on the Internet trumps all.\n\nYour Responsibilities\n\n  * Take charge of developing, improving and monitoring our proprietary credit model, a core component of our business.\n\n  * Lead review of credit applications, research business models and design the best way to evaluate risk\n\n  * Partner with tech and product team to design product features to significantly improve our proprietary credit risk engine\n\nYour profile\n\n  * Passionate for the internet and start-up industry\n\n  * Positive attitude and self-motivated\n\n  * Analytical, with strong communication skills, and the ability to operate with flexibility in a fast-paced, constantly evolving and collaborative environment.\n\n  * You’d be working closely with tech and product team to spec-out features that can significantly improve our model reliability and accuracy\n\nSo... are you excited about the new Fintech revolution that is changing our\ntime and you want to be part of it? Are you not afraid to push your boundaries\nand taking risk in unexpected adventures? Are you comfortable in receiving\nresponsibilities and trust that will overwhelm you?\n\n***To apply, please submit your updated resume.\n\n","job_title":"Credit Risk Analyst","salary":"SGD 2500 - 3500  (BASIC)"},{"company":"Aimazing","jd":"\n\nYour role is to:\n\n  * Drive data-based decision making through the creation and interpretation of insightful adhoc and regular reports from the internal platform\n\n  * Utilise technical architects to understand the implications of respective architectures on data architecture and to maximize the value of information.\n\n  * Drive standardization and simplification across the data architecture, lowering cost, improving quality and value of data\n\n  * Develop conceptual and logical data models for analytics, operational and data mart structures in accordance to industry best practices model(s).\n\n  \n\nWe hope you possess:\n\n  * Bachelor degree in Information Technology \/ Management or related discipline required.\n\n  * 3+ years of experience in designing and developing the conceptual, logical and physical design for distributed databases.\n\n  * 3+ years of experience in design and develop Metadata architecture and Master Data Management Solutions.\n\n  * Proficient in complex SQL queries is required for this role.\n\n  * Strong experience in Conceptual, Logical, and Physical Database architectures, best practices, and programming techniques around relational modelling, dimensional modelling and data integration.\n\n  * Experience with Big Data\/Hadoop\/NoSQL, Visualization and reporting tools, data profiling analysis and transformation preferred.\n\n  * Strong Business and Data Analysis skills\n\n  * Excellent communication (oral and written) and interpersonal skills\n\n  * Ability to thrive in a dynamic and fast-paced environment.\n\n  * Ability to work independently and as part of a team - works well in a collaborative environment.\n\n","job_title":"Analyst, Business Inelligence","salary":"SGD 2500 - 5000  (BASIC)"},{"company":"Katalystm Pte Ltd","jd":"\n\nKatalystM Business Data Analyst\n\n  \n\nAbout KatalystM:\n\nKatalystM is a Client Experience Agency with a very strong MarTech flavor.\nFounded in 2007 as primarily a Marketing Campaign Platform Implementation and\nSupport organisation, it has evolved into a complete end-to-end Marketing and\nSales Automation Agency which provides services to many world-class Brands,\nboth here in Singapore and around SEA.\n\nWith strong Vendor and Consulting Partnerships, and Alliances, KatalystM\ndeploys Marketing and Sales Automation Solutions in various Business Verticals\nincluding Hospitality, Retail, e-Commerce, Travel, and FSI.\n\n  \n\nResponsibilities:\n\n  * Perform campaign analysis, identify actionable insights, provide recommendations and influence the direction of our clients’ business marketing activities.\n\n  * Design and deploy dashboards in business intelligence tools, look for opportunities to automate processes, optimize efficiency and quality.\n\n  * Work on different marketing automation platforms, and work with clients from various industries.\n\n  * Support in client collateral creation; Power Point, Word document, charts, etc. \n\nBackground & Qualifications:\n\n  * Graduate from university or polytechnic\n\n  * Understand relational database structure and able to write SQL query\n\n  * Knowledge and experience in Business Intelligence tools preferred\n\n  * Knowledge and experience in R \/ Python preferred\n\n  * Understand research and data analysis methods to create statistics\n\n  * Have an analytical mindset and good learning attitude\n\n  * Able to work under pressure and independently\n\n  * Interested in data, online marketing, and \/ or commerce\n\n  * Must be Singaporean or Singapore PR holder\n\n  * Prefer candidate who can start immediately\n\n","job_title":"Business Data Analyst","salary":"SGD 2000 - 2500  (BASIC)"},{"company":"Anavantage Management Consultancy Llp","jd":"\n\nWe are recruiting full-time Business Consultants and Corporate Trainers who\nmeets the following candidate requirements. If the following describes who you\nare, we would like to speak to you. Email us with a detailed resume stating\nqualifications, past experiences and expected renumeration to\n[contact@anavantage.com](mailto:contact@anavantage.com). The candidate should\npossess the following: - Relevant qualifications (Diploma, Degree or\nPostgraduate Degree), preferably in a quantitative field with an emphasis on\nquantitative research skills, \\- Proficiency in at least one statistical\nand\/or data mining software\/tool, \\- Prior corporate teaching experiences in\nanalytics, statistics and\/or data mining, \\- Able to engage and manage adult\nlearners and possess a positive attitude, \\- Able to work independently on\ndata analytics consulting projects.\n\n","job_title":"Executive, Data Science Training and Consulting","salary":"SGD 2000 - 6000  (BONUS)"},{"company":"Carro","jd":"\n\nAbout Carro\n\nLaunched in June 2015, Carro is an online car marketplace that makes selling\nand buying cars between direct owners and sellers a breeze. Our mission is to\npromote transparency, trust & convenience to both the buyer & seller in the\ncar purchase experience. A marketplace only thrives when both the seller and\nbuyer gains. Hence, our vision is to become the car marketplace of choice\naround the region.\n\nCarro (a.k.a. Car Hero) helps facilitate and guide people through the entire\npurchase lifecycle (including transfers, car loans, insurance process, car\nworkshops, accessories). Our rabbit hole is located somewhere near Bishan, in\na beautiful, open-concept office.\n\nWe have a transparent, fast-paced work environment and highly value hard work\nand integrity. Hear it directly from our interns\nhttps:\/\/www.youtube.com\/watch?v=cmJP9yjnpUo!\n\nInterested in finding out more? Well, check out our video\nhttps:\/\/www.youtube.com\/watch?v=eamBzbxsepk & our website\n[https:\/\/carro.sg\/](https:\/\/carro.sg\/)\n\n#\n\nResponsibilities\n\n\\- Data management and engineering to collect and process data to be used in\nmodelling;\n\n\\- Apply different statistical\/machine learning models\/algorithms for given\nbusiness problem;\n\n\\- Employ strong business acumen to conceptualize\/design solutions;\n\n\\- Architect the overall supporting storage and compute infrastructure to\nsupport the deployment of the analytics models, applications and visualization\nof the results;\n\nWhat's in for you?\n\nWith the right attitude (e.g. proactive, persistent goal-getters who think\nahead & strive for continual improvement and excellence, are caring team\nplayers who support others, and willingly goes beyond their call of duty to\npropel the company to greater heights), Carro would be a rewarding and\nchallenging place to grow, contribute, & even forge lifelong friendships.\n\nYou can look forward to:\n\n\\- A dynamic, fast- growing and fast- paced environment where things are\nalways evolving as we constantly strive to improve\n\n\\- A caring, friendly team that supports each other to achieve their personal\n& company goals\n\n\\- Contributing to the noble mission of leading the automotive industry by\nproviding trustworthy solutions & top-notch experiences.\n\n\\- Professionally & personal development (opportunities are endless; it’s up\nto you to grab them!)\n\n\\- Working closely with & learning from experienced team-members, proposing &\nimplementing your ideas\n\n\\- A well-stocked pantry & regular team meals\/ outings!\n\n#\n\nRequirements\n\n\\- Masters\/Bachelors on Econometrics, Statistics, Applied Mathematics,\nComputer Science or related field;\n\n\\- Strong Python & MYSQL skills\n\n\\- 2 to 5 years of quantitative and qualitative resource and analytics\nexperience;\n\n\\- Knowledge and hands-on experience in applied mathematical\/statistical\nalgorithms, optimization methods and statistical modeling;\n\n\\- Able to synthesize data into actionable business insights;\n\n\\- Knowledge of analytical software\/tools and models\n\n\\- Proactive, quality-conscious, customer-oriented and results-oriented;\n\n\\- Good analytical ability, conceptual thinking, planning and organisational\nskills;\n\nOnly applications received via this link will be reviewed\n[https:\/\/goo.gl\/forms\/oQ6HpoHPI9VtgHXp1](https:\/\/goo.gl\/forms\/oQ6HpoHPI9VtgHXp1)\n\n","job_title":"Data Scientist\/ Engineer (Analyst) ","salary":"SGD 3000 - 5000  (BASIC)"},{"company":"Converzion","jd":"\n\nOur people is as important as our clients.\n\nHere at Converzion, you will understand and experience firsthand what it takes\nto succeed in a constantly evolving and demanding marketing landscape.\n\nThe key people who thrive are the ones who have adaptability, communicate\nclearly and most importantly, they get things done.\n\nWe are not looking for the next Sergei Brin or Satoshi Nakamoto. And we don’t\nexpect you to be.\n\n  \n\nHow do we see our next team member?\n\n  *  We all recognise the fact that we are constantly learning and we work to be better for each other.\n\n  * Able to define your goals and know how to reach them\n\n  * Able to not only learn but impart skills and values to the team\n\n  \n\nWhat type of qualities will succeed?\n\n  * You need to have experience in GTM. Our campaigns depend on you.\n\n  * You know the value of a best practice data layer and how technical audits and implementation are crucial to measurement success\n\n  * Our client and campaign people would like you a lot if you are able to share and present your hypothesis and insights\n\n  * They would love you even more if you know how to visualise the above in a simple yet effective manner\n\n  * You have the desire go go beyond your current skill set and comfort zone.\n\n  * You don’t take yourself too seriously and know when to have fun and when to focus on work.\n\n  \n\nWhat will you learn?\n\n  * First hand experience on understanding and building how our entire digital ecosystem.\n\n  * Plenty of opportunities to go beyond (literally and figuratively) , such as being involved in building digital products, sharing insights to new and existing clients or growing our digital presence across Asia, or being involved in launching in new countries..just to name a few.\n\n  * Communication is key to life and growth.\n\nAre you one of them?\n\nIf so, we would love to know more about you!\n\n***To apply, please submit your recent text CV.\n\n  \n\n","job_title":"Marketing Analyst","salary":"SGD 3000 - 4000  (BASIC)"},{"company":"Kpler","jd":"\n\nThe Opportunity\n\nKpler is recruiting a Data Analyst to help insuring the highest quality of the\ndata provided to its users on the platform.\n\n  \n\nJob Description\n\nThe role will involve maintaining the highest quality of commercial and trade\ndata for Kpler's online energy platforms. To do so you will be required to\ncarry out regular research and tracking of energy market news and perform\ndaily checks of Kpler data to ensure the reliability of daily shipping data\nand accuracy of cargo metrics available to our clients.\n\nYou will also participate in various medium and long-term data projects, and\ncontribute research across various commodity markets.\n\n  \n\nYou will be exposed SQL to query our internal database, Python for data\ncleaning, and data visualization for internal and external purposes.\n\n  \n\nYou will handle market or data related enquiries from clients and may attend\nclient meetings to discuss commodity market trends or data related topics.\n\n  \n\nWe are looking for a teammate who demonstrates strong capacities in logical\nthinking, attention to details, and a strong interest in energy markets. You\nwill be working with a small team in Singapore, while frequently collaborating\nwith our head office in Paris.\n\n  \n\n[Requirements](https:\/\/careers.kpler.com\/jobs\/international-sales-\nmanager_paris)\n\nIt could be the perfect fit if...\n\n  * you are a recent graduate with significant internship experiences\n\n  * you have strong interest in the energy market \n\n  * you have experience working with large, disparate and\/or unstructured data sets (advanced Excel skills with some VBA programming or any data analysis tools)\n\n  * you have an excellent analytical ability, at ease with working with databases, ability to highlight trends and use complex data to support decisions\n\n  * you are organized, a team player, and quick learner able to execute under short deadlines and across various tasks\n\n  \n\nTop reasons to join the team :\n\n  * Join a growing team evolving within in a fast-moving company with a worldwide presence\n\n  * Get exposure to the energy market and get a thorough understanding of how it works \n\n  * We offer an attractive salary according to profile and experience\n\n  \n\n","job_title":"Junior Data Analyst","salary":"SGD 35000 - 45000  (BASIC)"},{"company":"Agritrade International Pte Ltd","jd":"\n\nIT:\n\n  * Troubleshooting all IT related matters for the company and its entities.\n\n  * Managing company emails\n\n  * Setup \/ Maintain department email distribution list \/ functional IDs\n\n  * Printers and computers\n\n  * Internet connection \/ setup\n\n  * Assist in Enrolment \/ dekitting process\n\n  * Good knowledge and experience dealing with networks and servers.\n\n  * Strong ability in managing shared drives and providing access rights\n\n  * Experience with programming and scripting (google, script & etc) would be an advantage\n\n  * Knowledge dealing with phone and IT vendors\n\n  * Decent project management abilities in IT and office administration.\n\n  * Perform routine administrative tasks including data entry, filling, review billings and etc.\n\n  * Perform other related duties as may be reasonably assigned in the course of business.\n\nData:\n\n  * Interpret data, analyze results using statistical techniques, and provide ongoing reports.\n\n  * Develop and implement databases, data collection, systems, data analytics, and other strategies that optimize statistical efficiency and quality.\n\n  * Acquire data from primary or secondary data sources and maintain databases\/data systems.\n\n  * Identify, analyze, and interpret trends or patterns in complex data sets.\n\n  * Filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems.\n\n  * Work with management to prioritize business and information needs.\n\n  * Locate and define new process improvement opportunities.\n\n  \n\n###\n\nEDUCATION, WORK EXPERIENCE AND SKILLS\n\n  * A degree\/diploma in IT, Computer Science, Informatics, Information Systems\n\n  * At least 2 year(s) of working experience in the related field within a fast paced commercial organisation\n\n  * Ability to work on own initiative with a pro-active approach to work\n\n  * Able to work independently with minimal supervision and as part of administration team.\n\n  * Excellent problem-solving and organisational skills\n\n","job_title":"IT &amp; System Analyst","salary":"SGD 3000 - 3800  (BASIC)"},{"company":"Electric8 Pte Ltd","jd":"\n\nElectric8 is a digital consultancy based in Singapore that specialises in\nProduct, UX, Design and Growth. All of our work is informed by data and\nresearch, using a test-and-learn methodology.\n\nClients range from large corporations (Capitaland, Scripps Networks...) to\nfast growing start-ups (Evie, Mobikon, Helpster and HappyFresh...). We're a\nprofitable company and are looking to keep growing in 2018 (who isn't?).\n\nWe're looking for a talented cat (or dawg, we don't discriminate) to join the\nteam as a Growth Data Analyst to work on making data-informed, test-and-learn\nmarketing and product experiments for our clients. Check out our creds deck\nattached in this job post.\n\n  \n\nGoals You Will Own\n\n• Increasing the growth rate for our clients via the right channels and data\ninformed decisions\n\n• Driving brilliant growth ideas to creation, whilst supporting, inspiring and\ninstilling confidence with clients\n\n• Using customer insight and analytics to validate customer problems, drop-\noffs, campaign optimisations and solutions throughout the customer journey\n\n• Working with the clients to define the right growth strategy & KPIs for\nsuccess, building quantitative growth models and iterating towards them\n\n• Coaching clients into an Agile \/ Lean approach, driving ideas and innovative\nsolutions across various platforms, devices, applications and technologies\n\n  \n\nPossible Activities to Achieve Those Goals\n\n• Performing data analyses such as correlation, cohort, regression, Monte\nCarlo to answer quantitative questions to help unlock growth and product\noutcomes\n\n• Researching, implementing and testing new acquisition & retention tactics\nand loops\n\n• Implementing test-and-learn experiments on a lean framework to validate or\ndebunk test assumptions\n\n• Systemising validated tactics to be implemented as part of clients’ ongoing\nmarketing strategy\n\n• Outlining and implementing various growth experiments to improve various\nfunnel metrics\n\n• Analysing data from multiple sources to understand what is\/isn't working and\nwhy\n\n  \n\nExperience, Skills & Attitude Desired\n\n• Understanding of A\/B Testing, Cohort Analysis, Funnel Analysis, Segmentation\nAnalysis\n\n• Intermediate to Advanced Excel Skills\n\n• Intermediate to SQL Skills\n\n• Familiarity or experience with either of those channels is desirable: SEO,\nPaid Search, Display Advertising, Mobile Advertising, Social Media Advertising\n\n• Experience using Facebook and Google’s Advertising platforms\n\n• Ability to design or even hack at HTML\/CSS code comes in handy\n\n• A quantitative educational background preferred\n\n  \n\nSo... you got game?\n\n","job_title":"Growth Data Analyst","salary":"SGD 3000 - 4000  (BASIC)"},{"company":"mybitwallet","jd":"\n\nJob Details:\n\n• Understand business logic from domain experts and come up with reasonable\ntargets for data projects\n\n• Data fetching from different sources such as database, big data lake running\non Hadoop\/hive\n\n• Enhancing data by building autonomous pipelines from different sources\n\n• Doing analysis and presenting results in a clear manner\n\n• Make recommendations that aid in the realization of value and sustaining\nanalytical activities, which seek to embed analytical tools within business\nprocesses\n\n• Design analytical solutions to analyze data, alert and advise the business\non the threats and opportunities as and when needed\n\n• Locate and define new process improvement opportunities\n\n• Other ad-hoc duties as and when assigned\n\n***To apply, please submit your updated resume.\n\n","job_title":"Data Analyst","salary":"SGD 3000 - 4000  (BASIC)"},{"company":"Go Game Pte. Ltd.","jd":"\n\nYour go-Getting Mission\n\n  * Use statistical methods to analyze data and generate useful business reports\n\n  * Work with management team to create a prioritized list of needs for each business segment\n\n  * Identify and recommend new ways to save money by streamlining business processes\n\n  * Use data to create models that depict trends in the customer base and the consumer population as a whole\n\n  * Work with departmental managers to outline the specific data needs for each business method analysis project\n\nThe Prerequisites\n\n  * Bachelor’s or master’s degree in mathematics, statistic or analytics\n\n  * Experienced with R, SQL, Python and Tableau tools\n\n  * 5+ years in data mining experience\n\n  * 3+ years in data analyst experience\n\n  \n\nHow to Apply\n\nPlease apply for this position by submitting your CV to maojie.zhou@gogame.net\nwith the subject on Employment Application - Senior Data Analyst and your\nnotice period.\n\n  \n\nKindly note that only shortlisted candidates will be notified.\n\n","job_title":"Senior Data Analyst","salary":"SGD 3500 - 6000  (BASIC)"},{"company":"Axinan","jd":"\n\nAbout the Job:\n\n\\- Design and build data driven systems for risk control, fraud detection,\nrecommendation, customer segmentation, adaptive pricing etc.\n\n\\- Build, validate, test, and deploy models and algorithms.\n\n\\- Work with backend engineers to architect data storage and processing\npipelines.\n\n\\- Work with product managers to develop new product features based on\ninsights from data.\n\nWhat You Should Have:\n\n\\- Master or PhD in computer science, statistics, mathematics, or fields\nrelated to data mining preferred.\n\n\\- At least 2 years of relevant working experience.\n\n\\- Experience in Python or R.\n\n\\- Knowledge in supervised\/unsupervised learning, classification\/clustering\nalgorithms, feature engineering\/optimization\n\n\\- Experience in deep learning, reinforcement learning, personalized search\nand recommendation, user\/seller behavior modeling, marketing algorithms\npreferred.\n\n\\- Experience of Hadoop, Spark, Tensorflow is a plus.\n\n\\- Experience with visualization software to convert models\/insights into\nsimple, business sell-in stories would be an advantage (but not mandatory).\n\n\\- Outstanding analytical and problem solving skills.\n\n\\- Self-motivated, innovative, and proactive. Willing to learn new knowledge\nand explore unfamiliar domains.\n\nJoin us and get:\n\n\\- A chance to lead and grow quickly to transform a nascent InsurTech industry\n\n\\- To contribute to the development of high-impact FinTech products that will\nserve millions of customers across Asia\n\n\\- To work, play and hustle with a creative, fun and diverse community (think\nSilicon Valley, Europe and Asia all-in-one!)\n\n***To apply, please submit your updated resume.\n\n","job_title":"Data Scientist","salary":"1 <span>vacancy<\/span>"},{"company":"Search Personnel","jd":"\n\nPosition : Business Analyst Location : Tai Seng Working hours : 5.5 days (Mon\nto Fri 10am - 7pm, Sat 10am - 2pm) Salary : Up to $4,500 Duration : Permanent\nLeave policies : 24 days of annual leave per year (up to 17 days can be\nencashed)\n\n  \n\nMain Responsibilities: • Evaluate business processes, anticipate requirements,\nuncover areas for improvement, develop and implementing solutions. • Lead\nongoing reviews of business processes and developing optimization strategies.\n• Stay up-to-date on the latest process and IT advancements to automate and\nmodernize systems. • Perform requirements analysis. • Document and communicate\nthe results of your ideas, findings, and plans to cross-functional team\nmembers and management. • Gather critical information from meetings with\nvarious stakeholders and producing useful reports. • Work closely with\nclients, staff and managerial staff. • Provide leadership and guidance to\njunior staff. • Allocate resources and maintaining cost efficiency. • Perform\nuser acceptance testing. • Project development, project management, and\nmonitor deliverables. • Manage competing resources and priorities.\n\n  \n\nRequirements:\n\n• A Bachelor’s degree in business or related field or an MBA • Some experience\nin business analysis or a related field is an advantage • Exceptional\nanalytical and conceptual thinking skills\n\n• Exceptional communication skills with ability to influence and work closely\nwith stakeholders to determine acceptable solutions. • Some experience\ncreating reports and giving presentations. • Competent in Microsoft\napplications including Word, Excel, and Outlook. • Singaporeans only\n\nIn order to speed up the short listing process, qualified or interested\ncandidates are strongly encouraged to submit your updated resume in MS Word\nformat to wenqing@searchpersonnel.com.sg\n\nTo find out about other career opportunities in Search Personnel Pte Ltd, do\nvisit www.searchpersonnel.com.sg \/ www.facebook.com\/search.personnel for\ncomplete job listings. We wish you all the best in your career search. ***We\ndo not charge our candidates any referral fee.***\n\nWenqing Tan Executive Consultant Reg no.: R1872412 | EA No: 13C6684\n\n","job_title":"Business Analyst","salary":"SGD 3500 - 4500  (BASIC)"},{"company":"Shell Infotech","jd":"\n\n[Company : ]()Shell Infotech\n\nPosition : Data Analytics\n\nExp : 3 – 10 Years\n\nNotice : 1 Month\n\nLocation : Singapore\n\nJD As Below :\n\n[\\- ]()Background in ML and statistical approaches, and experience in applying\nthem\n\n- Passion for building ML models\n\n- Well verse in program languages such as Python, R\n\n\\- Familiar with popular ML frameworks such as Tensorflow, scikit-learn, AML,\netc.\n\n\\- Excellent written and communication skills\n\n\\- Good to have but not compulsory i.e. business knowledge covering trade\ncapture, trade processing, settlements, accounting, P&L reporting etc\n\n\\- Knowledge\/hands-on experience in agile project management methodology is\ndefinite plus\n\n\\- Work on design and develop Machine Learning (ML) algorithms\n\n\\- Provide help to other teams in optimizing the ML models\n\n\\- Use your creativity and intuition to help solve challenging problems faced\nby the Business users\n\n\\- Responsible for analyzing business dataset, design algorithm for prediction\nand optimization based on requirements\n\n\\- Present results of analysis to team and other stakeholders\n\n\\- Help in building a team and framework focusing on using ML to solve\nbusiness problems\n\n\\-\n\n","job_title":"Data Analytics","salary":"SGD 3000 - 6000  (BASIC)"},{"company":"Forte Employment Services Pte Ltd","jd":"\n\n<div>\n\n  *  **Location: Macpherson**\n  *  **Role: Permanent**\n  *  **Start up environment: Young & creative**\n\n<div>**CLIENT:** Founded in 2014, they help businesses to turn their data\nassets into real engines of growth by the use of Technology, Analytics and\nVisualisation to consolidating diverse data sets into one full view of data.\nThey have headquarter in Singapore and long-term global clients from Japan,\nKorea, India, Southeast Asia, Europe and America. With a primary focus on\nPharmacy, Healthcare and CPG, their client portfolio features an array of\nMNCs, public and private enterprises.<\/div>\n\n<div>**JOB DESCRIPTION**<\/div>\n\n  * Work with the business solutions team to identify customer requirements and expectations\n  * Evaluate and implement technology, analytics and visualization solutions for Pharma and healthcare clients\n  * Build frameworks for Pharma and Healthcare using the identified solutions\n  * Create best practices in technology and analytics to support pharma and healthcare companies\n\n<div>**REQUIREMENTS:**<\/div>\n\n  * Knowledge of Tableau is a MUST, skillset on R, Qlikview, MS Excel, SQL is an advantage.\n  * Require ability to multi-task, prioritize and manage projects. Demonstrated ability to communicate effectively in both presentation and verbal communications.\n  * High energy levels, “Can Do” attitude and works well under pressure to meet deadlines.\n  * Proven time management proficiency.\n\n<\/div><div>Interested candidates please click “**Apply**” below or send your\n**resume to miu@forteemp.com.sg** (in Word document). Thank you.<\/div>\n\n","job_title":"Data \/ Solutions Analyst (Tech Firm \/ Macpherson)","salary":"1 <span>vacancy<\/span>"},{"company":"Imapac Pte Ltd","jd":"\n\nYou will be working directly with the Head of production on one of our most\nimportant launches in\n\nbiologics portfolio. This is a unique experience to work directly with one of\nthe most talented\n\nindividuals in our business and a thought leader in the biologics conference\nindustry.\n\n  \n\nTo complete the Conference Production Intern work for IMAPAC Pte Ltd, this\nincludes but not\n\nlimited to:\n\n Following the directions provided in the conference business plan,\nconference\n\nprogramme, event brief and instruction manual (provided by IMAPAC Pte Ltd)\n\n Assist the Conference Producer and Project Director in executing conference\n\nproduction activities such as topic and market research, testing commercial\nviability\n\nof the conference programme, inviting and confirming speakers, content\ngeneration,\n\ntimeline management, take minutes of meeting and follow up on the discussed\n\nactivities, etc.\n\n Writing and editing conference marketing materials like brochures and EDMs\n\n Assisting with project write-ups and descriptions\n\n Maintenance of statistical databases\n\n Attend (if required) and play a critical role in the delivery of our world\nclass\n\nconferences\n\n You will represent IMAPAC Pte Ltd as Conference Production Intern during the\n\ncontract period.\n\nWhat You Will Gain:\n\n Communicating and building relationships with potential business partners,\nassociations and\n\nvendors\n\n Exposure to balanced blend of business vs design thinking practices vital\nfor success in the\n\nmodern working environment\n\n Exposure to and experience with various project management and operation\npractices, plans\n\nand strategies\n\n Receive valuable feedback on your working style and performance which would\nhelp\n\nimprove and enhance your skills and attributes\n\n A personalised pathway to develop under the guidance of experienced project\nmanagers\n\n  \n\n The opportunity to become a full time employee of the company, with your own\nportfolio of\n\nconferences\n\n Visibility into the inner workings of a fast growing conference industry\n\n Hands-on knowledge on various aspects of conference production\n\n Direct communication and network building with leaders in the biologics and\nlife science\n\nindustry\n\n Opportunity to curate and publish relevant content for the company’s\nconferences\n\n  \n\nRequirements\n\n  \n\n Able to command well in English and Chinese language, and even better,\ncommand of one or\n\nmore of the Asian languages such as:, Japanese, Korean or Bahasa Indonesian\n\n Passionate and willing to learn about conference management, market research\nand biologics\n\n A really excellent communicator. concise, engaging, calm and thorough.\n\n Looking to work somewhere fun. Yearning for more responsibility and a reason\nto look\n\nforward to Mondays.\n\n Able to work as an intern in Singapore with one of the following status:\n\n1\\. You are a Singaporean or Singapore permanent resident\n\n2\\. You are a foreign national and are currently doing an undergraduate degree\nwhere\n\ninternship is a requirement to complete your studies\n\n Local Singaporean or Permanent Resident preferred\n\n  \n\nPlease apply directly to hr@imapac.com with your detailed resume and cover\nletter. Only shortlisted\n\ncandidates with be notified.\n\n","job_title":"Conference Production Intern","salary":"SGD 800 - 800  (BASIC)"},{"company":"Msd International Gmbh Singapore","jd":"\n\nMSD is collaborating with Infocomm Media Development Authority (IMDA) to\nconduct a Company-Led Training (CLT) Program. This is a structured development\nprogram that aims to enable fresh graduates to acquire specialist competencies\nfor jobs in demand by the industry in the area of data analytics.\n\nWe are recruiting the following candidates:\n\n  \n\nUp to three years of working experience & possess a degree or diploma in a\nSTEM (Science, Technology, Engineering or Mathematics) discipline. If you fall\ninto this category, you will receive 12 months of on-the-job training from MSD\nand may be offered a full-time job in MSD after completing your training. To\nqualify for this program, you must be able to start the training as soon as\npossible and no later than 1st July 2018.\n\nOther eligibility criteria can be found here: https:\/\/www.imda.gov.sg\n\/industry-development\/programmes-and-grants\/individuals\/company-led-training-\nprogramme-clt\n\n","job_title":"Associate Specialist (Data Analytics) - Company Led Training","salary":"SGD 2500 - 5000  (BASIC)"},{"company":"Apara Hotel Advisers Pte Ltd","jd":"\n\nWe provide structured hotel asset management and advisory services exclusively\nto hotel investors, owners and developers across the Asia\/Pacific region.\n\nCurrently manages more than 50+ hotels acorss all market segments through its\nbroad range of in-house skill sets thereby providing comprehensive hotel\nadviser from development and build, pre-opening, hotel operations, investment\nand exit strategies.\n\nWe require full time diploma grad in Business or Accounting, with strong\nqualitative and quantitative skills. Interest in hospitality is preferred.\n\nResponsibilities\n\n1\\. Collate and maintain key market and tourism statistics for the locations\nof properties\n\n2\\. Collate and review daily reports and other such regular reports submitted\nby the properties into established Apara databases\n\n3\\. Regularly review the data structures and formulas of the various Apara\nReports and databases\n\n4\\. Support Asset Managers in preparation of feasibility studies and other\nfinancial or statistical analysis through data collation and validation\n\n5\\. Compile benchmarking reports with relevant performance indicators from the\nApara databases and other external sources of information to support business\nanalysis and budget reviews as directed by the Asset Managers,\n\n6\\. Prepare monthly, quarterly and other periodic reports covering both\nproperty performance, market trends and other relevant indicators for the\nAsset Managers and clients,\n\n7\\. Support annual budget reviews and other ad-hoc projects (such as\nfeasibility studies, pre-opening budgets, transition plans etc) of the\nproperties through data collation and analysis\n\n8\\. Support and assist in the development and enhancement of Apara Reports and\ndatabases\n\n","job_title":"Business Executive in Data Analytics","salary":"SGD 1800 - 2000  (BASIC)"},{"company":"CSRWorks International Pte Ltd","jd":"\n\nAbout Us\n\nCSRWorks International is Singapore’s leading boutique-style sustainability\nconsulting firm with more than 13 years of successful track record.\n\n  \n\nCSRWorks offers a range of services including sustainability strategy, SGX\nsustainability reporting, GRI-based sustainability reporting, integrated\nreporting, materiality analysis, stakeholder engagement, supply chain, green\nmanufacturing, ESG analysis, training and external assurance. Our\ninternational team of consultants has produced more than 130 sustainability\nreports.\n\n  \n\nCSRWorks has created highly successful annual Asia Sustainability Reporting\nAwards as our own corporate responsibility initiative on a not-for-profit\nbasis. Our yearly publication Sustainability Reporting: Learn from Asia's Best\nchronicles best practices in sustainability reporting from across the region.\n\n  \n\nWe organise the hugely successful annual Asia Sustainability Reporting Summit,\nthe first regional conference on sustainability reporting.\n\n  \n\nCSRWorks offers a suite of sustainability reporting training, including the\nGRI Standards Certified Course, and a host of other high impact sustainability\ncourses across the region.\n\n  \n\nWorking at CSRWorks\n\nCSRWorks offers professional, empowering and friendly work environment with\nchallenging opportunities in a boutique office setting.\n\n  \n\nPosition\n\nCSRWorks International is looking for a talented ESG Analyst to assist our\nsenior sustainability consultants. We are looking for a bright candidate with\n1-2 years experience in a similar role or a fresh graduate\/postgraduate with\nexcellent academic credentials and a good understanding of sustainability\nissues. We are looking to hire one full time and one part time analyst.\n\n  \n\nResponsibilities\n\nIncluding but not limited to:\n\nEnvironmental, social and governance research and benchmarking\n\nESG gap analysis\n\nContribute to sustainability reporting projects\n\nSustainability surveys\n\nDevelop ESG ratings models\n\nESG data analysis and presentation\n\nBusiness development, branding and marketing support\n\nContribute to\/independently manage sustainability initiatives, events and\nprojects as and when required\n\nProject management\n\n  \n\nRequirements\n\nExcellent written and verbal communication skills\n\nStrong aptitude for research, report writing, data and statistical analysis\nand presentation\n\nAwareness \/ knowledge of sustainability reporting frameworks (GRI and IR) and\nsustainability indices\n\nVery high proficiency in MS Office (Word, Excel and PowerPoint) required\n\nAbility to deliver high quality work in a fast-paced multi-project environment\nwith tight deadlines\n\nPositive attitude, energetic, quick learner and resourceful\n\nTrustworthy, self-starter and independent\n\nAttention to details\n\nMulti-tasking, hard-working, and flexible\n\n  \n\nQualifications\n\nBachelor’s degree or above in CSR, business management, economics,\ncommunications, finance\/accounts, environment management. Prior internship\nexperience in sustainability or in a related field will be a definite\nadvantage.\n\n  \n\nStart date: Immediate\n\n  \n\nRemuneration: Excellent, based on qualification and experience\n\n  \n\nHow to apply\n\nPlease send your detailed CV with a cover letter and a recent photograph,\nindicating your current salary and expected salary.\n\nInterested individuals may apply directly to HR@csrworks.com\n\n  \n\nWho should apply\n\nOnly those candidates should apply who have the right to work in Singapore.\n\nOnly shortlisted candidates will be contacted.\n\n  \n\nFor more information about CSRWorks, please visit www.csrworks.com\n\nTo know more about the Asia Sustainability Reporting Awards, please visit\nwww.csrmatters.com\n\n","job_title":"ESG Analyst","salary":"1 <span>vacancy<\/span>"},{"company":"Shopee Singapore Private Limited","jd":"\n\n  \n\nShopee is the largest mobile-first eCommerce marketplace in Southeast Asia and\nTaiwan. The Shopee team believes in the transformative power of technology. As\nshopping on mobile devices becomes the ‘new norm’, Shopee aims to continually\nenhance its platform and become the region's top mobile commerce destination.\nShopee is supported by Garena, Southeast Asia’s largest internet platform\nprovider.\n\n  \n\nOfficially launched in 2015, Shopee has exponentially grown in popularity\nwithin the region. We have had more than 80 million downloads in the region\nand an annualized gross merchant value of 5+ billion USD. The team has also\nbeen growing in numbers and is now 2,500+ full time employees strong, spanning\nacross 8 countries in 10 offices.With the rapid expansion of the Shopee team,\nwe are constantly on the lookout for potential young talents who have the\npassion and drive to become part of a fast-moving and dynamic team.\n\n  \n\nIf you are someone with a curious mind, always searching for opportunities to\ngrow, and enjoys working in a dynamic and fast-paced environment, this is the\nperfect opportunity for you!\n\n  \n\nResponsibilities\n\nLabeling images with the correct tags to facilitate Data Science team in image\nrecognition project\n\n  \n\nRequirements:\n\nMeticulous and detail orientated\n\nStudents who have just completed their 'A' levels are welcomed to apply!\n\n  \n\nRequired period for internship:\n\nImmediate start for a minimum of 1.5 to 2 months commitment\n\n5 working days a week (Mon-Fri) from 9.30am to 7pm, with 1.5h for lunch break\n\n","job_title":"Part Time Admin Assistant in Data Science team ","salary":"SGD 800 - 800  (BASIC)"},{"company":"Astek International","jd":"\n\nAstek is proposing an opportunity for a Big Data Developer to support one of\nour clients in the banking industry.\n\nResponsibilities:\n\n  * Knowledge expert for Alteryx and Tableau \n\n  * Creation of correct, robust queries against raw data \n\n  * Design appropriate database objects and extracts to improve reporting \n\n  * Automate cleansing and transformation of raw data \n\n  * Demonstrated success helping business users work with raw data \n\n  * Provide recommendations on Big Data Technology usage and develop data flows in and out of the Big Data environment \n\n  * Collaborate with business stakeholders and analyze user requirements \n\n  * Create interactive dashboards and visualizations leveraging Tableau, Qlik, Microsoft BI \n\n  * Build required data extracts required for solutions \n\n  * Deliver transformative solutions to clients that are aligned to industry best practices and provide thought leadership in data space \n\nRequirements:\n\n  * Minimun of 6 years’ experience reporting or systems development \n\n  * At least six months direct experience using Alteryx \n\n  * Database development using PL\/SQL or T\/SQL\n\n","job_title":"Big Data Developer","salary":"SGD 4500 - 7500  (BASIC)"},{"company":"Singapore Sailing Federation","jd":"\n\n#\n\nJob Responsibilities\n\n1. Research into current Olympic sailing classes and development pathways into future classes to match international trends.\n\n2. Keeping Singapore Sailing aligned to the dynamic changes in sailing, gathering, and analyzing knowledge, learning new techniques and introducing them to coaches and sailors.\n\n3. To track and analyze sailor’s performance using Athlete Management Software.\n\n4. Assist Head of High Performance on athlete management issues.\n\n5. Assist in administering athlete selection policies.\n\n6. Other High Performance related administrative tasks.\n\n7. Stand-in coaching when needed.\n\n#\n\nRequirements:\n\n-Minimum A levels \/Diploma \/ Above\n\n-Proficient in Microsoft Word \/ Excel \/ PowerPoint\n\n-Good command of English (written and spoken)\n\n- Interest in outdoor sports\n\n- Organized and efficient\n\n- Willing to travel overseas with teams\n\n\\- Able to work occasional weekends\n\n\\- Diligent, meticulous and has initiative\n\n- Outgoing personality with sporting background will be an advantage\n\n\\- Transport provided\n\n","job_title":"Assistant Manager-Analytics\/Technology (High Performance)","salary":"1 <span>vacancy<\/span>"},{"company":"Central Provident Fund Board","jd":"\n\nAs trustee of the nation’s savings, our work shapes the future of\nSingaporeans. In our hands we hold the future of real people and real lives.\n\nWe foster an environment of trust and encourage positive relationships for\neffective teamwork. We offer you the space to develop with meaningful\nopportunities and fresh challenges. We adopt a total rewards focus comprising\ncompetitive remuneration, attractive benefits and non-monetary recognition.\n\n You will be responsible for the setup, implementation, maintenance and\nupgrade of the middleware services including the security and resiliency of\nthe data assets\n\nResponsibilities\n\n· Troubleshooting, technical administration and operational support of the\nmiddleware services\n\n· Participate in change, release and deployment activities\n\n· Ensure compliance to database security standards and policies\n\n· Upkeep of middleware related assets and documentation of operational support\nprocedures\n\nRequirements\n\n· Tertiary education in Computer Science, Engineering or equivalent\n\n· At least 2 years of working experience in middleware administration and\ntechnologies with focus in Websphere, MQ and API.\n\n· Familiarity in one or more of the followings:\n\n>   * Good experience in software development, system technology, middleware\nand backup & disaster recovery solutions\n\n>\n\n>   * Good experience in middleware design, maintenance and security of\nwebsphere or MQ solutions\n\n>\n\n>   *  IBM MQ Administration experience\n\n>\n\n>   *  Linux Administration and Windows Server Administration\n\n>\n\n>   *  Troubleshoot technical issues\n\n>\n\n· Possess and utilise significant breadth and depth of experience and will be\nexpected to work with little supervision.\n\n· Familiarity in ITIL processes and procedures\n\n· Ability to work beyond business hours and weekends for work contingencies\nwhere necessary\n\n· Successful candidate will be based in East Singapore\n\n· Fresh graduates are welcome to apply\n\nFind out more at [CPF Careers](http:\/\/www.cpf.gov.sg\/careers) page.\n\nTRUST. Everything We Stand For.\n\n","job_title":"Middleware Administrator","salary":"1 <span>vacancy<\/span>"},{"company":"Talent Hunt 2","jd":"\n\n  \n\n","job_title":"test","salary":"SGD 1 - 5  (BASIC)"},{"company":"ZEN Rooms- Rocket Internet- Singapore","jd":"\n\n **Job Summary**\n\nZEN Rooms, is the hospitality arm of the world's fastest growing internet\nbased venture capitalist- Rocket Internet (Market capitalization: 7 Billion\neuros). ZEN Rooms has a dominant presence in 8 countries, namely Singapore,\nMalaysia, Indonesia, Philippines, Thailand, Hong Kong and Sri Lanka. As we\ngrow, we plan to venture into other countries such as Vietnam and the middle\neast. We have more than 1500+ hotels and serviced apartments in these\ncountries. We are one of the fastest growing hospitality brand, in the world\nand we would like to invite you to join us, in this growth.\n\n **What do we want?**\n\nWe are on the lookout for motivated, curious, and delightful people who are\nexcited about working on challenging problems!\n\nAs this is a highly strategic, creative and collaborative role, you will need\nto interact with peers from different parts of the company some of whom may\neven be in different countries!\n\n<div>\n\n **Responsibilities and Duties**\n\n **Responsibilities:**\n\n  * Ensuring occupancy and revenue targets are met\n\n  * Monitoring key performance metrics and taking necessary action (involving both internal and external stakeholders) promptly\n\n  * Performing data analytics (working closely with BI team) to track and improve KPI performance\n\n  * Reporting to internal and external stakeholders\n\n  * Liaising with other functional teams to ensure deliverables are on track\n\n **Qualifications and Skills**\n\n  * A degree in Economic or Statistics (if a fresh graduate)  **OR**\n\n  * 1 year experience in REVENUE MANAGEMENT\/PRICING \n\n **AND**\n\n  * You are analytical & hard working\n\n  * You are proficient in Excel\n\n  * You like to take responsibility and work under pressure & you are not looking for an easy 9 -5 job\n\n  * You are ready to experience the pace and fast growth of an eCommerce startup\n\nJob Type: Permanent\n\nSalary: $3,000.00 to $5,000.00 \/month\n\n<\/div>\n\n","job_title":"Full Time Opportunity! Revenue Management Associate","salary":"SGD 3000 - 5000  (BASIC)"},{"company":"ZEN Rooms- Rocket Internet- Singapore","jd":"\n\nJob Role:\n\n  * Ensuring occupancy and revenue targets are met\n\n  * Monitoring key performance metrics and taking necessary action (involving both internal and external stakeholders) promptly\n\n  * Performing data analytics (working closely with BI team) to track and improve KPI performance\n\n  * Reporting to internal and external stakeholders\n\n  * Liaising with other functional teams to ensure deliverables are on track\n\nRequirements:\n\n<div>\n\n  * Job open only for Singaporean Locals and PR pass holders.\n\n  * You are a economic\/statistics graduate (bachelors)\n\n  * Prefered: Experience in Revenue Management\n\n  * You are analytical & hard working\n\n  * You are proficient in Excel\n\n  * You like to take responsibility and work under pressure & you are not looking for an easy 9 -5 job\n\n  * You are ready to experience the pace and fast growth of an eCommerce startup\n\n<\/div>\n\n","job_title":"Revenue Management Associate","salary":"SGD 500 - 1000  (BONUS)"},{"company":"UMeKang","jd":"\n\nJob Description:\n\n  * We are looking for 2 Analytics Advertising Managers. The successful candidate will be involved in creative internet advertising, including selling of ad inventory space, calculating CPM, CPI, working on RTB bidding, and other internet monetization strategies.\n\nJob  requirement:\n\n  * Previous advertising experience is preferable, but not necessary.\n\n  * A university degree  is preferable, but not necessary.\n\n  * The successful candidate must have a very strong passion for internet advertising. He\/she will love creative online advertising, using internet metrics to enhance value for both us and the advertisers.\n\n","job_title":"Analytics Advertising Manager","salary":"USD 9000 - 11000  (BASIC)"},{"company":"Fundnel Pte Ltd","jd":"\n\nFundnel is a licensed private investment platform that offers unlisted\nsecurities in growth and pre-IPO stage companies across industries to a\nqualified network of investors, comprising of both professional – corporate\nventure, private equity, venture capital funds, family offices, angel investor\nnetworks – and individually accredited investors actively looking to diversify\ntheir current portfolio.\n\nWe screen all investment opportunities to ensure businesses meet the minimum\nrequirements defined by the Fundnel Factor –a proprietary data-driven due-\ndiligence process analysing over 130 quantitative data points per company* –\nbefore reaching our investor network. Our network of investors perform further\ndue-diligence before making an \"Anchor Investment” in a particular deal they\nsee value in. Only deals with a lead anchor investor will be listed on our\nplatform, whereupon other investors are invited to join the investment round.\n\nFundnel is headquartered in Singapore and has a growing team of over thirty\npeople spread across regional deal offices in Indonesia, Malaysia and\nAustralia.\n\nTotal deal origination value on our network exceeds US$100mm+ with 22‎\ntransactions completed to date.\n\nSome things to know before you apply:\n\n•           We have big plans to disrupt the traditional fundraising process\nfor private businesses\n\n•           You will work with a diverse team of former investment bankers,\nstrategy consultants and business owners in developing, monitoring and\nimproving products to facilitate the activity of private investing\n\n•           Everything we do is focused on helping businesses do business,\nbetter\n\n•           We work really hard but play really hard as well\n\nRoles & Responsibilities\n\n•           Oversee and lead the development of the Deal Management System\n(our proprietary data-driven platform for screening and management of\ninvestments); structure and link databases, formalise and implement data\ncollection systems, data analytics pertaining to platform metrics and\nfinancial data that we collect in the process of taking on investments, and\nother strategies that optimise statistical efficiency and quality\n\no   Interpret data, analyse results using statistical techniques, identify\ntrends and patterns in complex data sets, and provide ongoing deal analytics\nreports to support investment decisions\n\no   Contribute to data mining architectures, modeling standards, reporting,\nand data analysis methodologies\n\no   Collaborate with unit managers, end users, development staff, and other\nstakeholders to integrate Deal Management System and Analytics within existing\nsystems\n\no   Process, cleanse, and verify the integrity of data used for analysis\n\no   Identify and define new process optimisation opportunities\n\n•           Provide timely information and insights regarding customers,\nmarkets, and campaign effectiveness, to measure performance and support\nbusiness decisions for product development and marketing enhancement\n\no   Implementation and maintenance of web analytics tracking tools (i.e. Adobe\nAnalytics\/DTM and Google Analytics\/GTM) to aid in collection of web analytics\ndata\n\no   Able to gather insights from offline and online traffic sources to aid in\nmarketing efforts\n\no   Retrieval, monitoring, and analysis of all web analytics metrics to gain\ninsights to support the marketing team with testing, decision making and\nfurther optimisation\n\no   Improving the understanding of the customer's web behavior and optimising\nthe web experience through opportunity identification in tandem with the UX \/\nUI team\n\n•           Leading the CRM system used to collect and track customers on the\nFundnel platform\n\no   Maintenance of CRM tool – internally with the team and externally with\nvendors\n\no   Oversee tech implementations for collection of customer data\n\no   Process, cleanse, and verify the integrity of data used for analysis in\nCRM tool\n\no   Extraction of data for KPI reporting and analysis\n\no   Targeting customers using relevant customer activity\/data sources through\nCRM tool\n\n•           Managerial role over the data management team (including hiring\nand monitoring the team)\n\n•           3rd party vendor management and integration for various analytics\ntools used across platforms\n\nSkills & Experience Required\n\n•           4+ years of experience\n\n•           Strong experience with implementation of marketing analytics,\ntracking code and tag integration\n\n•           Experience using Adobe Analytics, DTM, Google Analytics , GTM\n\n•           Familiar with A-B \/ MVT testing\n\n•           Data Visualisation experience\n\n•           Strong analytical skills with the ability to collect, organise,\nanalyse, and disseminate significant amounts of information with attention to\ndetail and accuracy\n\n•           Good applied statistics skills, such as distributions, statistical\ntesting, regression, etc.\n\n•           Technical expertise regarding data models, database design\ndevelopment, data mining and segmentation\n\n•           Proficiency in Microsoft Office\n\n•           Preference for Candidates with an understanding of machine\nlearning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision\nForests, etc.\n\n•           A Diploma or Degree in Mathematics, Economics, Computer Science,\nInformation Management or Statistics\n\nThe ideal candidate should be\n\n•           Interested in dealing with data, including finding and exploring\nmore efficient ways\/programs (e.g. machine learning) to collect, store, and\nanalyse data\n\n•           Able to provide thought leadership in web\/product analytics\n\n•           Preferably have some understanding of terms in financial\nstatements and financial ratios\n\nPart of a product team working across various product domains with a focus on\noptimization of product through KPI's and metrics\n\n","job_title":"Head, Data Analytics","salary":"SGD 5000 - 8000  (BASIC)"},{"company":"Integer Alpha Pte Ltd","jd":"\n\n<div>Responsibilities<\/div><div><div><div>Analyzing trade data.\n<\/div><div><div>Building data sets for analysis. <\/div><div><div>Assist in\ndevelopment of analytical tools to enhance trading\nstrategies.<\/div><div><div>Formulate quantitative models for\nmarkets.<\/div><div><div><div><div>Qualifications<\/div><div><div>Academic\ndegree in Financial Engineering, Statistics\/Mathematics, Computer Science or\nother quantitative field of study.<\/div><div><div>Excellent quantitative and\nanalytical skills.<\/div><div><div>Interest in financial markets and ability to\ncomprehend market events.<\/div><div><div>Excellent problem solving\nabilities.<\/div><div><div>Meticulous, committed and\nhardworking.<\/div><div><div>Programming knowledge and experience is a\nplus.<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div>\n\n","job_title":"Quantitative Analyst","salary":"1 <span>vacancy<\/span>"},{"company":"Infinite Computer Solutions Pte Ltd","jd":"\n\n  * should have Teradata SQL skills\n  * SQL, Database, ETL, data loading\n  * 2 years exp as tech lead, over all experience around 8 to 10 years\n\n","job_title":"Teradata","salary":"1 <span>vacancy<\/span>"},{"company":"greypanel","jd":"\n\n","job_title":"Technical Support","salary":"2 <span>vacancies<\/span>"},{"company":"Lithan Academy","jd":"\n\n### JOB DESCRIPTION\n\n  * Perform data extraction, cleaning, transformation, validation and profiling\n  * Perform data mining, model building and machine learning to create predictive analytics\n  * Create data visualization and communicate insights and action items to the relevant stakeholders\n\n<div>\n\n#### JOB REQUIREMENTS\n\n  * Aged 21 years and above\n  * At least 2 years of working experience\n  * At least A' Level\/Diploma qualifications\n  * Willing to undergo 9 months of training\n  * Singaporeans or PRs only\n\n<\/div>\n\n","job_title":"Data Analyst\/Data Scientist","salary":"SGD 3000 - 5000  (BASIC)"},{"company":"Monetary Authority of Singapore","jd":"\n\nCreate meaningful dashboards for various departments in MAS.\n\n<div>The staff will be attached to various projects.<\/div><div>The core skill\nset required is JavaScript<\/div><div><div><div>This is a 11-Month Contract\nrole, extendable.<\/div><\/div><div><div>PR, Citizen only.<\/div><div><div>We do\nnot require any working experience, or good academic results. As long as you\ncan demonstrate your skills and are capable to deliver the\nprojects.<\/div><div>Fresh graduates are welcome.<\/div><div><div>The position\nis immediately available. <\/div><div><div>If you are interested, you can send\nyour resume to <\/div><div>danielle_jiang@mas.gov.sg<\/div><div><div>It would be\nbetter to indicate your experience in front end\/UI development\n<\/div><div><div>We will then arrange assessment and\ninterview.<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div>\n\n","job_title":"Front End Developer","salary":"4 <span>vacancies<\/span>"},{"company":"Cloak Pte. Ltd.","jd":"\n\nYou’re a curious and business driven builder, someone excited about creating\nsoftware that works way better than competing solutions for global users.\nTogether, we’ll create and iterate on data protection tools of the future—and\ngrow our Cloak Apps user base, one referral at a time.\n\nThis position is with Cloak’s data science consulting team.  We help our\nenterprise clients makes smart decisions amid a fast moving and uncertain\nfuture, by transforming existing data into useful insights and compelling\nstories. You are expected to follow best-in-class processes of data\npreparation, data analytics, deep machine learning, visualization and business\nconsulting to create rewarding values for our esteemed clients.  If you love\nbringing creative flair to complex challenges, and you’re pretty handy with\ncutting code as well as high intensity business preparation, our A-Team wants\nto talk with YOU.\n\nCloak enables security in cloud-based data storage and applications.  A fast\ngrowing startup, Cloak won multiple awards with its Cloak Apps Data Protection\nSoftware-as-Service.\n\nThis is your opportunity to join an energetic and experienced team based in\nMalaysia Johor or Singapore, and build customized secure solutions for our\nenterprise customers, on multi-platforms such as iOS, Android, Mac OS X and\nWindows platforms.\n\n **Responsibilities** :\n\n•      Conceptualize, build and validate machine learning model using proven\nand experimental techniques.\n\n•      Improve existing machine learning or suggest state-of-art solutions to\nachieve company's business goal, through activities such as define hypotheses,\ndevelop and execute necessary tests, experiments and analysis.\n\n•      Develop machine learning solution based on team’s analysis\n\n•      Present confidently your proposals, insights, findings and conclusions\nto our clients\n\n **Requirements** :\n\n•      Masters \/ Ph.D. in Computer Science, Electrical\/Computer Engineering,\nOperations Research or Mathematics\/Statistics Preferred, Or\n\n•      Top graduating degree in computer science.\n\n•      Minimum 1 year of relevant experience with machine learning techniques\nand advanced quantitative analytics (e.g. regression, classification,\nclustering, time series).\n\n•      Understanding of NLP, machine learning, deep learning, data mining,\nalgorithmic foundations of optimization.\n\n•      Proven problem-solving skills in complex and advanced technical\nsubject.\n\n•      Basic knowledge of digital marketing.\n\n **Advantages** :\n\n•      Proficient in one or more of the following programming languages:\nPython, R, Java, Scala.\n\n•      Experience with machine learning framework (tensorflow, scikit-learn,\nSpark MLlib etc).\n\n•      Experience in building ML models at scale, using real-time big data\npipelines on platforms such as Spark\/MapReduce.\n\n•      Extensive knowledge of mobile & web technologies, mobile & web\napplication design and development.\n\n•      Solid background in programming in Swift, Objective C, Java, PHP, Ajax,\nAdobe Flex, SQL (relational DB). Knowledge in other programming languages\nincluding scripting languages is a plus.\n\n•      Knowledge of crypto APIs on Web, iOS and\/or Android platforms.\n\nPlease email [hr@cloakapps.com](mailto:hr@cloakapps.com) for any queries.  We\nlook forward to speak to you.\n\n","job_title":"Data Science Developer","salary":"SGD 3000 - 4000  (BASIC)"},{"company":"OPUS IT Services Pte Ltd","jd":"\n\n<div>The scope of services for DC Operations Management Services as listed in\nsubsequent sections below, shall include, but shall not be limited to, the\nfollowing:<div>\n\n<div>(a) Environmental Monitoring. (b) Security Management. (c) System and\nNetwork Monitoring. (d) Production Control and Scheduling. (e) System Backup,\nRecovery, Media and Offsite Management. (f) User ID Management.<\/div>\n\n<div><div><div>**Requirements:**<\/div>\n\n  * Relevant technical IT expertise and skills in Virtual Servers \/ Windows server & Linux.\n  * 2-3 years of relevant working experience in a Data Centre environment and shall be continually assessed to achieve the best interpersonal skills and strong communication skills in handling the end users.\n  * Ability to perform day-to-day Data Centre \/ computer operations (batch processing, printing reports, systems backup, tape management, server reboots, facilities and infrastructure checks in the data center).\n  * Demonstrate initiative to pro-actively monitor the data centre systems’ uptime and connectivity to ensure system availability to prevent any down time, and coordinate problem resolution with vendor or second level support groups. To log and submit problem management record and assigned to appropriate party. To manage physical security procedures strictly.\n\n<\/div><div>Working Location: Expo \/ Paya Lebar<div><div>***Keen applicants\nkindly attach your applications with your updated\nresumes.<\/div><\/div><\/div><\/div><\/div><\/div>\n\n","job_title":"Data Centre Operator (Expo \/ Paya Lebar)","salary":"SGD 2400 - 2750  (BASIC)"},{"company":"AIMIA","jd":"\n\n#\n\nLead Consultant, Analytics & Insights\n\nMore about Aimia and what we do\n\nLoyalty management is the process of identifying, understanding and\ninfluencing best customers in order to build sustained, reciprocal and\nmeaningful relationships that increase profits and drive long term enterprise\nvalue. We are Aimia and it is our vision to be the recognised global leader in\nloyalty management.\n\nAcross our global enterprise we offer a full suite of services delivered\nthrough three loyalty service streams:\n\n· Coalition Loyalty – designing, building and managing multi-partner and\nshared currency loyalty programs around the globe\n\n· Proprietary Loyalty – designing, building and managing strategic business\nand customer loyalty programs for individual clients around the globe\n\n· Loyalty Analytics – collecting, analysing and deriving actionable insight\nfrom customer data to deliver measurable marketing ROI for clients and\npartners around the globe\n\nHere in Asia Pacific, Aimia has proven experience in partnering with clients\nto deliver leading proprietary loyalty programs across the region. Our\nproprietary loyalty service experts design, launch and operate new client\nprograms, re-launch, refresh and operate existing client programs and bring\nour digital, mobile and analytical expertise to bear on behalf of clients. As\nwe continue on our journey to realise our vision to be the recognised global\nleader in loyalty management, we are actively building out our capability to\noffer increased services across the loyalty analytics and coalition loyalty\nstreams.\n\nHere in Singapore we are an office of 80+ employees, located at 1 Harbourfront\nPlace, #18-04\/06 Harbourfront Tower One, Singapore 098633\n\nWhat is the focus of this role?\n\nThe main responsibility of the Lead Consultant, Analytics & Insight is to lead\nlarge scale customer insight projects for AIMIA’s clients and to work closely\nwith the Business Development & Account Management teams. The role also forms\npart of the functional leadership team, with direct line management of\nanalysts and senior analysts within the team. The role requires the candidate\nto work independently and take direct ownership of client relationships and to\nshape and drive forward engagements.\n\nResponsibilities include:\n\nTeam Management\n\n· Direct line management of Analysts and Senior Analysts within the team\n\n· Responsible for the management and development of the intern program\n\n· Mentoring role with some consultants\n\n· Able to effectively conduct interviews for Analysts to Consultant grade\n\nTeam Strategy\n\n· Shape the team’s future, structure and product offering\n\n· Own “Quality & Delivery” for the entire Analytics & Insight Team\n\n· Find the best ways of working with the consulting and data management sub\nteams\n\nDelivery\n\n· Own the successful delivery of multiple key clients, and provide review and\nchallenge support on others clients\n\nEssential skills and experience:\n\n· Mature, experienced analytics professional\n\n· Company minded with a focus on building success for Aimia without\nlimitations\n\n· Confident in developing client ready deliverables and presenting them\nindependently to clients\n\n· Experience in leading a team of analysts with diverse backgrounds\n\n· Able to shape the org structure and ways of working for the team\n\n· Prior experience with consumer marketing programs\n\n· Highly experienced user of SAS, SQL or R\n\n· Significant Loyalty, CRM & Marketing knowledge\n\n· Team player who can work in a cross-functional environment\n\n· Minimum 8 years of analytical working experience\n\nUseful characteristics include:\n\n·Ability to see the clients point of view and focus on successful outcomes\n\n·Understand the importance of recognizing both the big picture and day to day\nrequirements\n\n·Strong organizational and planning skills\n\n·Knowledge of relationship marketing practices and principles would be ideal\n\n·Good verbal and written communications skills and good attention to detail\n\n·Strong mentoring and coaching skills\n\nWhat is success in the role?\n\n·Deliver on the department’s financial and balanced scorecard targets\n\n·Maintain good staff retention and engagement\n\n·Support high client satisfaction scores\n\n·Contribute to growth by supporting business development\n\n·Successfully balancing multiple priorities\n\n·Managing multiple internal and external stakeholders\n\nWhy would you not take the role?\n\n· If you are focused on technical or academic analytics\n\n· Are keen to be a deep-dive expert in a particular type of analytics\n\n· Are not confident managing people or clients\n\nWhy would you take the role?\n\n· Looking for leadership experience within a growing global organisation\n\n· Want to combine a technical role with a management and business role\n\n· Enjoy internal and client interactions\n\n· Want to shape the direction of a proposition\n\nNorm�{���\n\n","job_title":"Lead Consultant -Insight &amp;Analytics","salary":"SGD -7 - 12  (BASIC)"},{"company":"AIMIA","jd":"\n\n# Consultant, Analytics & Insights\n\n **More about Aimia and what we do**\n\n _Loyalty management is the process of identifying, understanding and\ninfluencing best customers in order to build sustained, reciprocal and\nmeaningful relationships that increase profits and drive long term enterprise\nvalue. We are Aimia and it is our vision to be the recognised global leader in\nloyalty management._\n\nAcross our global enterprise we offer a full suite of services delivered\nthrough three loyalty service streams:\n\n·         **Coalition Loyalty** – designing, building and managing multi-\npartner and shared currency loyalty programs around the globe\n\n·         **Proprietary Loyalty** – designing, building and managing strategic\nbusiness and customer loyalty programs for individual clients around the globe\n\n·         **Loyalty Analytics** – collecting, analysing and deriving\nactionable insight from customer data to deliver measurable marketing ROI for\nclients and partners around the globe\n\nHere in Asia Pacific, Aimia has proven experience in partnering with clients\nto deliver leading proprietary loyalty programs across the region. Our\nproprietary loyalty service experts design, launch and operate new client\nprograms, re-launch, refresh and operate existing client programs and bring\nour digital, mobile and analytical expertise to bear on behalf of clients. As\nwe continue on our journey to realise our vision to be the recognised global\nleader in loyalty management, we are actively building out our capability to\noffer increased services across the loyalty analytics and coalition loyalty\nstreams.\n\nHere in Singapore we are an office of 80+ employees, located at 1 Harbourfront\nPlace, #18-04\/06 Harbourfront Tower One, Singapore 098633\n\n **Job Description Summary**\n\nTo provide data analytics and customer insight support to AIMIA’s clients and\nMarketing teams.\n\n **Job Description**\n\nWhat is the focus of this role?\n\nTo provide data analytics and customer insight support to AIMIA’s clients and\nMarketing teams.\n\n **Responsibilities include:**\n\n·         Strategy\n\n·         Which business drivers have the biggest impact on customer\nrelationship strength and business results?\n\n·         What KPIs really matter to the client’s business?\n\n·         How can AIMIA track these KPIs on an ongoing basis?\n\n·         Planning\n\n·         Determine which customers to target for marketing campaigns using\ntechniques including statistical clustering and RFM segmentation\n\n·         Predict when and what customers will buy and redeem\n\n·         Identify types of customer promotions required to enable upsell,\nengagement, recognition and win back\n\n·         Execution\n\n·         Track client KPI performance\n\n·         Track member quality and migration\n\n·         Track effectiveness of promotions\n\n·         Essential skills and experience:\n\n·         A highly motivated individual with an interest in data-driven\nmarketing insights\n\n·         Prior experience using SAS or SPSS\n\n·         SQL knowledge would be advantageous\n\n·         Strong Microsoft Excel & PowerPoint skills\n\n·         Minimum 5 years of analytical working experience\n\n·         CRM & Marketing knowledge\n\n·         Useful characteristics include:\n\n·         Quantitative and comfortable working with large amounts of data\n\n·         A self-starter with analytical astuteness, able to work with tight\ndeadlines\n\n·         Significant client contact and presentation aptitude\n\n·         Team player who can work in a cross-functional environment\n\n·         Good verbal and written communication skills along with high\nattention to detail\n\n·         Ability to provide recommendations based on analytical findings\n\n **What is success in the role?**\n\n·         Deliver insight and meet tight deadlines\n\n·         Deliver on account specific KPIs and program performance targets\n\n·         Why would you not take the role?\n\n·         Not looking to be a deep-dive analytics expert\n\n·         No interest in developing your statistical software skills\n\n·         Not interested in detail and prefer to focus on the big picture\n\n **Why would you take the role?**\n\n·         Looking for analytical experience within a growing global\norganisation\n\n·         Love data and deep dive exploratory analysis\n\n·         Have a passion for marketing & customer analytics\n\n·         Enjoy working with statistical software\n\n·         Want to focus on the technical side of analytics\n\n·         Enjoy internal and client interactions\n\n·         Take satisfaction from seeing your recommendations implemented by\nour clients\n\n","job_title":"Consultant _Insight &amp; Analytics","salary":"1 <span>vacancy<\/span>"},{"company":"MTS Gold Global Trading Pte. Ltd.","jd":"\n\n#### We are a growing proprietary trading firm based in Singapore; mainly\ntrading in commodities and currencies\n\n### Responsibilities:\n\n  * Support Algorithmic trading platform along with in-house developed and vendor tools\n  * Coordinate with new installations and configuration management\n  * Develop Algorithms, Strategies, tools, Scripts as per requirement to address recurring issues\n  * Mediate between traders and Brokers or Vendor to communicate the requirements, bugs etc and follow up on the status\n  * Support real-time trading for both Trading system and surrounding architecture\n\n###  Requirements:\n\n  * Good analytical and problem-solving skills\n  * Proficiency in C++, Python is must\n  * Data Analysis Knowledge - is huge plus\n  * Quick learner and team player\n  * Fluent in English\n  * Linux - huge plus\n\n<div><div>\n\nInterested candidates please send your latest resume to\n[recruit_sg@mtsgoldgroup.com](mailto:recruit_SG@mtsgoldgroup.com) with your\nname in subject.\n\n<\/div><\/div>\n\n","job_title":"Support Analyst","salary":"2 <span>vacancies<\/span>"},{"company":"NTT Data Singapore","jd":"\n\n<table><tbody><tr><td>\n\nEssential Duties and Responsibilities include:\n\n  * Design data collection methods, evaluate large amounts of data, decompose high level information into details, abstract up from low-level information to a general understanding, analyze trends, and distinguish appropriate requirements\n  * Review product results from field or test usage to determine functional gaps or inconsistencies\n  * Run data through test tools to create reports and identify product success patterns\n  * Provide additional support as necessary to create and modify product templates, label data, and manipulate data for product improvement purposes\n\n  * 2-4 years of experience in a quantitative role\n  * Experience with the open source Elastic Stack (Elastic Search, Logstash, Kibana)\n  * Exposure to SQL and NoSQL databases and document stores such as SQL Server, MongoDB, RavenDB\n  * Knowledge in data mining, machine learning, natural language processing, or information retrieval\n  * Experience processing large amounts of structured and unstructured data\n\n **Education**\n\n  * BA \/ BS degree with strong academic record, ideally in Mathematics, Statistics, or Computer Science\n  * Excellent verbal and written communication skills\n  * Must be a self-starter, with relentless curiosity and attention to detail\n  * Analytical, creative, and innovative approach to solving problems\n  * Positive, people-oriented, and energetic attitude\n  * Demonstrated ability to work with ambiguous requirements, adapt, and learn\n  * Meticulous attention to detail and excellent problem solving\/troubleshooting skills\n\n<\/td><\/tr><\/tbody><\/table>\n\n","job_title":"Data Analyst","salary":"SGD 4000 - 5500  (BASIC)"},{"company":"NTT Data Singapore","jd":"\n\nEssential Duties and Responsibilities include:\n\n  * Design data collection methods, evaluate large amounts of data, decompose high level information into details, abstract up from low-level information to a general understanding, analyze trends, and distinguish appropriate requirements\n  * Review product results from field or test usage to determine functional gaps or inconsistencies\n  * Run data through test tools to create reports and identify product success patterns\n  * Provide additional support as necessary to create and modify product templates, label data, and manipulate data for product improvement purposes\n\n  * 2-4 years of experience in a quantitative role\n  * Experience with the open source Elastic Stack (Elastic Search, Logstash, Kibana)\n  * Exposure to SQL and NoSQL databases and document stores such as SQL Server, MongoDB, RavenDB\n  * Knowledge in data mining, machine learning, natural language processing, or information retrieval\n  * Experience processing large amounts of structured and unstructured data\n\nEducation\n\n  * BA \/ BS degree with strong academic record, ideally in Mathematics, Statistics, or Computer Science\n  * Excellent verbal and written communication skills\n  * Must be a self-starter, with relentless curiosity and attention to detail\n  * Analytical, creative, and innovative approach to solving problems\n  * Positive, people-oriented, and energetic attitude\n  * Demonstrated ability to work with ambiguous requirements, adapt, and learn\n  * Meticulous attention to detail and excellent problem solving\/troubleshooting skills\n\n","job_title":"Data Engineer","salary":"SGD 4000 - 6000  (BASIC)"},{"company":"Infinite Computer Solutions Pte Ltd","jd":"\n\nRole and Responsibilities:\n\n  * Extensive knowledge and experience with DB2\n  * Hasknowledge of related database architecture and development methodologies. \n  * Demonstrated proficiency in structured analysis and technical design techniques. \n  * Demonstrated proficiency in creating and maintaining high degree of confidence between technical team, business teams and proficiency in directing and influencing others for the purpose of creating and the most efficient and scalable databases. \n  * Makes well-thought-out decisions on complex or ambiguous database issues\n  * Provide technical database expertise and\/or solution delivery support for maintaining performance and reliability of database solutions\n  * Build and maintains knowledge of new technologies or technology opportunities and assists in development of analysis for business and\/or IT clients\n\nQualifications and Education Requirements\n\n·         Degree holder in IT\/Computer Science or related field\n\nPreferred Skills\n\n  * At least 5+ years of experience with DB2 database administration\n  * Experience with Unix\/Linux\/Windows OS platforms\n  * Database performance tuning experience\n  * Ability to develop Shell scripts for automating routine database maintenance is a plus\n  * Experience with logical and physical database design is preferred\n  * Experience with SQL and\/or PL\/SQL code is preferred\n  * Able to provide 24x7 on-call support within a team rotation\n  * Working knowledge of replication, clustering, monitoring, backup, restoration, reporting utilities and capacity planning\n  * Must be familiar with Banking environment.\n\nEA License No. - 14C6941\n\n","job_title":"DB2 DBA","salary":"SGD 5000 - 7000  (BASIC)"},{"company":"Sourcemind FZ LLC","jd":"\n\n<div>\n\n### We are looking to hire a team of passionate “Data Engineers” who can bring\nexponential impact to the business in the field of machine learning, deep\nlearning and data science. Should be able to solve complex business problems\nwith and contribute to the building of digital platform which will be\nunderpinned by data science and big\/real time data. Someone who has done the\nlong hours in this field and ideally attained expertise.\n\n#### Capability (required):\n\n####  • Minimum 5 years related work experience\n\n#### • Proficiency in the area of Machine Learning, Deep Learning & Predictive\nModelling\n\n#### • Well versed in Data Engineering, Data Mining, Feature Engineering,\nModel Engineering on BigData eco system(Hadoop, Spark, Hive, etc)\n\n#### • Expert in R, Python, Spark MLlib , NLP\n\n#### • Passion for technology and ability to adapt to new environment.\n\n<\/div>\n\n","job_title":"Data Engineers","salary":"USD 1000 - 2000  (BONUS)"},{"company":"Infinite Computer Solutions Pte Ltd","jd":"\n\nRole and Responsibilities\n\nA database administrator's responsibilities can include the following tasks:\n\n·         Installing and upgrading the Oracle server and application tools\n\n·         Allocating system storage and planning future storage requirements\nfor the database system\n\n·         Creating primary database storage structures (tablespaces) after\napplication developers have designed an application\n\n·         Creating primary objects (tables, views, indexes) once application\ndevelopers have designed an application\n\n·         Modifying the database structure, as necessary, from information\ngiven by application developers\n\n·         Enrolling users and maintaining system security\n\n·         Ensuring compliance with your Oracle license agreement\n\n·         Controlling and monitoring user access to the database\n\n·         Monitoring and optimizing the performance of the database\n\n·         Planning for backup and recovery of database information\n\n·         Maintaining archived data on tape\n\n·         Backing up and restoring the database\n\n·         Contacting Oracle Corporation for technical support\n\nQualifications and Education Requirements\n\n·         Degree\/Diploma in IT\/Computer Science\n\nPreferred Skills\n\n5+ years of production support experience as Oracle DBA\n\n  * Solid Oracle 11gR1\/R2 RAC experience including build, general administration, troubleshooting (Break\/Fix) and performance tuning skills\n  * Experience in Clusterware (GRID Infrastructure) - CRS management and configuration\n  * Skilled in Oracle ASM and Dataguard administration\n  * SQL & Database Level performance tuning skills\n  * Demonstrable experience of managing high-performance, high-capacity databases in a critical production environment.\n  * Expertise in backup and recovery and migration using RMAN, datapump and export\/import.\n  * Experience in maintenance and management of databases using Oracle Enterprise Manager Grid Control.\n\n·\n\nEA License No. - 14C6941\n\n","job_title":"Oracle DBA","salary":"SGD 5000 - 7500  (BASIC)"},{"company":"Infinite Computer Solutions Pte Ltd","jd":"\n\nRole and Responsibilities\n\n·         Sybase ASE and Replication server Unix (Environments and Shell\nScripting) SQL Monitoring and Supporting the day to day activities.\n\n·         Monitoring the Sybase database and maintain the health of the system\nproviding on- call support as the first line of support resolution of\nincidents related to database develop.\n\n·         A good understanding of the existing application (technical) and\nliaise with Production DBA at group level for issue resolution flexible\napproach and on- call supports.\n\n·         Use technical and application knowledge to investigate issues raised\nand assist in the production of Incident reports, which form part of the shift\nhandover\n\nQualifications and Education Requirements\n\n·         Degree\/Diploma in IT\/Computer Science\n\nPreferred Skills\n\n·         Seeking 5+ yrs. experience in Sybase DBA\n\n·         Good experience with Performance tuning.\n\n·         Experience in providing Production support for Sybase ASE database\nversions - 11.9.0, 12.5, 12.5.4 and 15.0.2.\n\n·         Manage\/Review database management system error logging. Manage and\nperform physical database maintenance (including running of appropriate\nautomated procedures, utilities, jobs, scripts). Sybase database, database\nadministration, change management\n\n·\n\n·         EA License No. - 14C6941\n\n","job_title":"Sybase DBA","salary":"SGD 5000 - 7500  (BASIC)"},{"company":"Infinite Computer Solutions Pte Ltd","jd":"\n\nRole and Responsibilities\n\n·         Proactive monitoring of SQL database server\n\n·         Disk space Monitoring\n\n·         Log file\/TempDB growth\n\n·         Database backup & recovery\n\n·         SQL native backup\n\n·         Database health check, housekeeping, Rebuild, Reorganization,\nStatistic Update\n\n·         Experience on Performance analysis, tuning using: SQL Profiler,\nCustomize Query,\n\n·         Performance monitor\n\n·         Inbuilt reports\n\n·         Experience on High Availability administration\n\n·         SQL Clustering, Mirroring & Log shipping\n\n·         Experience with MS SQL Server 2012 in a clustered environment and\nAlways on\n\n·         Experience on database migrations, up-gradation and patching\n\nQualifications and Education Requirements\n\n·         Degree\/Diploma in IT\/Computer Science\n\nPreferred Skills\n\n·         5+ Years on multiple versions of Microsoft SQL Database Server.\n\n·         Experience  on Microsoft SQL Clustering Operations knowledge on\nSharepoint\/MOSS Operations\n\n·         Knowledge on Active Directory and Group Policies Operations\nknowledge on MS HYPER V Operations knowledge in any one enterprise tool SCOM\nand Opalis\n\n·         Experience of leading initiatives\/projects Having skill on\nautomation and scripting Windows MSH, Window powershell\n\n·         Should be able to analyze data and take decisions\n\n·         Should be able to plan the deliverables and execute on time\n\n·         Good presentation and documentation skill Good inter-personal and\nanalytical skill ITIL Process knowledge\n\n·         Good in stakeholder management, risk issue management Project\nManagement Skill Due-diligence Experience\n\n·         Transition Experience\n\n·         EA License No. - 14C6941\n\n","job_title":"SQL Server DBA","salary":"SGD 5000 - 7000  (BASIC)"},{"company":"UMeKang","jd":"\n\nJob Responsibilities:  \n• Design, develop and evaluate innovative models for predictive learning.  \n• Use all available data, undertaking data discovery and exploration to\nidentify opportunities, develop strategies and techniques to improve results.  \n• Develop tools for complex statistical analysis using R, SAS, MATLAB, Python\nor a similar statistical package.  \n• Translate technical details, observations and results into business\nlanguage.  \n• Protect the Company's interests in method development and application when\ninterfacing with competitors, customers, partners or suppliers.  \n• Engage with project owners regularly to review project results, improve\nquality and satisfy all project requirements.  \n• Use machine learning, data mining and statistical techniques to create new,\nscalable solutions for business problems  \n• Analyze and extract relevant information from business data to help automate\nand optimize key processes  \n• Design, develop and evaluate highly innovative models for predictive\nlearning  \n• Establish scalable, efficient, automated processes for large scale data\nanalyses, model development, model validation and model implementation  \n• Research and implement novel machine learning and statistical approaches\n\nJob Requirements:  \n• Academically strong with an advanced degree in a strong quantitative\ndiscipline such Maths, Statistics or Computer Science.  \n• Experienced with Predictive Analytics, advanced Analytics and Machine\nlearning algorithms.  \n• Expert knowledge of at least one of the following programming languages or\nequivalents: Python, R or SAS. Also nice to have knowledge on softwares and\nplatforms like Spark, Hive, Pandas in Python, SQL, Qlik, Tableau, Power BI,\nSPSS, Matlab, JMP etc.  \n• Good ability to interpret complex business requirements, translate into\nanalytical problems and deliver high value outputs.  \n• Excellent verbal and written communication skills and the ability to\ninteract professionally with diverse group, managers and subject matter\nexperts.  \n• Proactive and motivated to take on new challenging technical problems and\nability to deliver high-quality results in accordance with the timeline.\n\n© 2017 - UMeKang gives you the power to share information and connect with\nother people in a healthy manner. Visit umekang.com now for more available\njobs\/careers.\n\n","job_title":"Data Scientist","salary":"USD 9000 - 11000  (BASIC)"},{"company":"Zhirendao Investment Pte Ltd","jd":"\n\nQuantitative Researcher\n\nAs a Quantitative Researcher, you will work with traders and back-test their\nalphas and strategies using cutting edge technologies. You will work with them\nto solve complex problems and develop scripts in R\/python to test and automate\nthe system.\n\nThis is a great opportunity for a good R\/python developer with very strong\nquantitative skills to take a front office development role in a fast paced\nand entrepreneurial environment. You will be given a huge amount of exposure\nto trading\/portfolio management therefore this role is suited to a\nquant\/developer looking for a long term career in this domain.\n\nACTIVITIES YOU WILL BE WORKING ON\n\n-       Work with portfolio managers and researchers to provide assistance with the simulation platform\n\n-       Design and develop scripts in C++\/Python\n\n-       Work in a fast paced front office environment\n\n-       Implement testing scripts\n\n-       Technical documentation\n\nRequirements\n\n-       R\n\n-       Python\n\n-       C++\n\n-       Great communication skills\n\n-       Desire to work in a fast paced and dynamic front office environment\n\n-       Degree: Master\/PhD in quantitative field.\n\n-       Undergrad with excellent academic result will be considered.\n\n","job_title":"Quant Researcher","salary":"SGD 3000 - 5000  (BASIC)"},{"company":"Eatigo Singapore Pte Ltd","jd":"\n\n# The Opportunity\n\nA highly dynamic, modern and very international work environment. An ambitious\nyoung company that brings real innovation to the F&B scene in Thailand &\nSingapore. A competitive package for the right people. A chance to be part of\nsomething special, to join this company when it is still young and really\nleave your mark. Influence the culture of this company and make it yours as\nmuch as it is ours.\n\nThe Analytics Team understands the analysis requirements of diverse set of\ncustomers - from Business Teams to Marketing Teams to Product Teams. An\nAnalyst is expected to grasp the underlying data requirements of these teams\nand develop reports\/analysis that adds value to the respective teams.\n\nIf you believe in the power of data, information and business empowerment\nthrough actionable insights and metrics, please say HI to us !!\n\nYou will be responsible for using predictive modeling, statistics, trend\nanalysis, and other techniques to collect, explore, managing, coordinating and\nidentify the data from internal; and external sources. You will work closely\nwith all internal departments to support our reporting and analysis needs,\ntherefore you must be detail-oriented, persistent problem solvers, customer-\ndriven, and able to interact professionally with both of internal and external\nclients.\n\nYou will partner with multiple teams and leverage your vast analytical skills\nto ensure business health and stand apart from the competition. You will\nreport to the Head of Business Intelligence directly.\n\n# What You Will Learn\n\n# Job Description\n\nYou will be responsible for, but not limited to, the following activities:\n\n· Churn actionable insights that inspires the business\n\n· Focus on communication of insights and presentation\n\n· Build forecasting models to forecast our business to take corrective actions\n\n· Skills to help partners identify next steps within their areas and action on\nit.\n\n· Discover customer behaviour patterns and transform it into actionable\nconsumer insights\n\n· Proactively evangelize analytics & insights within Eatigo\n\n· Lead the reporting development, execution, and distribution\n\n· Increase business awareness towards the past, current, and future heading\nbusiness condition\n\n# Requirements\n\n **Experienced Required:**\n\n· Minimum 2 years experience in Analytics domain especially in the online\necommerce industry\n\n· Should be able to logically break down a problem\n\n· Should be able to define metrics and goals from data\n\n· Experience in collaborating and supporting sales\/marketing\/development team\nanalysis and performance measurement\n\n **Skills Set Required:**\n\n· Minimum 2 years work experience\n\n· Proficient in SQL, Excel\n\n· Qlikview\/Qliksense exposure will be a plus\n\n· Exposure to Qlikview,Qlik Sense, Google Analytics, Omniture, SAS, R, Python,\nTableau , Scala would be a huge plus but not compulsory\n\n· Proficiency in 1 or more programming language (e.g. Python, R, Java, C++,\netc.)\n\n· Bachelor degree in Computer Science, Mathematics, Statistic, Economics,\nPhysics, Operations Research or related field preferred\n\n· Any experience in BI, previous experience working as a Consultant would be a\nplus\n\n· Excellent written and verbal communication skills\n\n· Ability to perform complex data queries and translate it to become\nactionable insights\n\n","job_title":"Senior Business Analyst (Bangkok)","salary":"1 <span>vacancy<\/span>"},{"company":"Go-Jek","jd":"\n\n# The Opportunity\n\nOur data science team is based in Singapore, and working on a ton of exciting\nprojects! If you're an independent thinker and all-rounded person, this is the\nplace for you.\n\n# What You Will Learn\n\n# Job Description\n\n  * Selecting features, building and optimizing machine learning models\n  * Data mining using state-of-the-art methods\n  * Extending company’s data with third party sources of information when needed\n  * Enhancing data collection procedures to include information that is relevant for building analytic systems\n  * Processing, cleansing, and verifying the integrity of data used for analysis\n  * Doing ad-hoc analysis and presenting results in a clear manner\n  * Building continuous deployments and productionizing machine learning models\n  * A\/B Testing for models evaluation\n\n# Requirements\n\n  * At least 1 -2 years of experience in a data science role working with large data sets\n  * Self-driven and entrepreneurial with a strong sense of ownership\n  * Excellent understanding of machine learning techniques and algorithms\n  * Experience with common data science toolkits, such as Scikit-Learn, R, Weka, MatLab, etc\n  * Great communication skills\n  * Possess good understanding of design thinking, solid CS fundamentals\n  * Good applied statistics skills, such as distributions, statistical testing, regression, etc\n  * Good scripting and programming skills.\n  * Experienced with Python, R , Golang, Scala, R and Shell\n  * Ability to whiteboard some theory while at the same time rolling up your sleeve and get coding Ability to work independently to solve problems and develop solutions\n  * Experience with experimenting on different modelling techniques (supervised and unsupervised learning) and develop data visualisation for data stories\n  * Kaggle \/ Hackathons experience a plus\n\n","job_title":"Data Scientist","salary":"1 <span>vacancy<\/span>"},{"company":"Dr. Banner","jd":"\n\n# The Opportunity\n\nThis is a very exciting project, as we’re looking to setup the tech team\noutside of France HQ, to assist for more development of the Dr. Banner\nplatform and adapting it for the Asia markets.\n\nThis will be an ongoing big project, as we scale up to cover the whole of\nAsia, including China.\n\nShort video presentation of Dr. Banner:\n<https:\/\/www.youtube.com\/watch?v=_enpwp0EypU>\n\n# What You Will Learn\n\n# Job Description\n\n  * There is no tool-oriented recruitment when we look at data scientists; only education and eventually experience – meaning what they have been working on previously.\n  * Evidently, a candidate having worked around the type of data that we handle daily (SSP data, bid requests etc.) would be ideal.\n  * We’re aiming to build a DMP (Data Management Platform), in which we could consolidate clients’ data and process them into actionable segments.\n  * Another tool-keyword is “Machine-Learning” – a set of tools that aim at introducing predictability in data.\n\n# Requirements\n\n  * Data Science, Data Analysis, Python.\n  * Any related studies in Data Science or Data Analysis would be a plus point.\n\n","job_title":"Data Scientist","salary":"SGD 2500 - 4000  (BASIC)"},{"company":"Tookitaki","jd":"\n\n# The Opportunity\n\n# What You Will Learn\n\n# Job Description\n\nThe engineering team is responsible for building a robust forecasting\nplatform, which can add significant value to BFSI vertical in solving\noperational and compliance risk problems. We take pride in building the system\nright and continuously evolving it. You have freedom to choose the right tools\nfor the task. We also encourage to participate in and contribute to open\nsource community.\n\n **Job Perks**\n\n  * Pay package decided by merit and not by last drawn CTC\n  * Development machine of your choice ( Mac, Windows or Linux)\n  * No fixed working hours and WFH in place\n  * Unlimited access to renowned AI, ML books\n  * Health Insurance benefits covering outpatient and hospitalization\n  * Telephone bill claims up to SGD 40 per month\n  * Everything good at a start up\n\n# Requirements\n\nOur engineering team is looking for a big data engineer with work experience\nof 2-4 years. He would be responsible for contributing to product development\nand would be considered a good fit if he possess following qualities:\n\n  * You ship high quality unit tested code\n  * You have deep experience with one or more of Java, Scala or Python language\n  * You have experience with big data ecosystem - Hadoop, Spark\n  * You have fundamental understanding of Web - HTTP and REST APIs\n  * You have used some distributed no-sql stores and understand the design trade offs\n  * You have fundamental understanding of statistics and machine learning\n  * You enjoy digging into open source project and contributing back\n  * You have a keen desire to learn and grow\n\n **Educational\/Professional Requirement**\n\n  * BE or MS in Computer Science from Tier-I college\n  * Work Experience: 2-4 yrs\n  * Work Permit: Candidate should have work permit\n  * Preferable if Singaporean or Singaporean PR\n\n","job_title":"BigData Engineer","salary":"SGD 6500 - 8000  (BASIC)"},{"company":"PatSnap","jd":"\n\n# The Opportunity\n\n# What You Will Learn\n\n# Job Description\n\nAs an NLP R&D Engineer you will have the key responsibility including but not\nlimited to of researching and applying the latest trends in Natural Language\nProcessing to our big data sets comprising of 120+ million patent documents\nand more. Responsibilities include planning and management of ETL statistical\n& textual analysis pipeline while creating meaningful features in our\ndifferent products for our clients and stakeholders. The successful candidate\nalso have a chance to lead and build up the team capabilities within PatSnap.\n\n# Requirements\n\n  * Master or Ph.D, research direction is Natural Language Processing\n  * Domain Knowledge in Natural Language Processing \/ Machine Learning \/ Data Mining\n  * Deep understanding in at least 3 of the following: Sentiment Analysis, Entity Extraction, Natural Language Understanding\n  * Strong knowledge on deep learning for NLP\n  * Experience with Word Disambiguation and Word Embeddings\n  * Experience with open-source NLP toolkits such as CoreNLP, OpenNLP, NLTK, Gensim, LingPipe, Mallet, etc.\n  * Strong understanding of text pre-processing and normalization techniques, such as tokenization, POS tagging and parsing and how they work at a low level.\n  * Proficiency with common used programming languages such as C, C++, Python, Java and R\n  * Expertise in producing, processing, evaluating and utilizing training data\n  * Knowledge of Software Engineering best practices and standards\n  * Experience working with engineers and product managers\n  * Ability to present research progress to senior management\n\n","job_title":"NLP Engineer","salary":"SGD 5000 - 10000  (BASIC)"},{"company":"Optimate","jd":"\n\n# The Opportunity\n\nOptimate is creating the next generation cutting edge AI based marketing\nautomation SaaS for the fast growing digital marketing industry. We are\npresent in SEA and Silicon Valley. We work with over 200 clients including the\ntop agencies in the world including Mirum and WPP.\n\n# What You Will Learn\n\n# Job Description\n\nWe are looking for a Data Scientist to work with the existing team, build and\nrefine the current system for media buy optimization across different social\nmedia platforms and build APIs for various ad exchanges and DSPs.\n\n **Responsibilities:**\n\n  * Improve the current algorithms for optimization\n  * Build EA models for various industry sectors based on historical and real time ad insight data\n  * Work with the development team to test, verify and deploy the machine leaning models for process automation\n  * Work with the sales team to understand customers’ requirements and seek new and improved ways to optimize their ad delivery through optimate\n  * Carry out operational processing tasks for existing and new clients\n  * Document and safeguard the IPs\n\n# Requirements\n\n  * Master’s Degree in Computer Science, Statistics, Applied Math or related field\n  * 2+ years’ practical experience with data processing, database programming and data analytics\n  * Extensive background in EA and dynamics optimization problems\n  * Able to understand various data structures\n  * Experience with programming languages such as Java and Python\n\n","job_title":"Data Scientists","salary":"1 <span>vacancy<\/span>"},{"company":"Movel AI","jd":"\n\n# The Opportunity\n\nMovel AI is developing a software platform to enable robots to perceive the\nenvironment the same way that humans do, with much higher localization\naccuracy.\n\n# What You Will Learn\n\n# Job Description\n\nWork with highly motivated individual in the field of robotics To develop a\nstate-of-art AI technology using computer vision\n\n# Requirements\n\n  * Ph.D. or equivalent experience in Electrical Engineering, Computer Science, or related fields\n  * At least five years of experience in computer vision, image processing and machine learning with applications in object recognition and object tracking Experience with MATLAB, Python, C++, OpenCV\n  * Knowledge of the state-of-the-art in Deep Learning and applicable libraries such as Torch, Theano, TensorFlow\n  * Strong presentation and written communication skills\n  * Hands-on software and algorithm development\n  * Commitment to developing quality software\n\n **Desired Experience**\n\n  * Experience in one or more of the following: autonomous vehicles or robots, internet of things applications\n  * Experience in developing applications that scale with data Leadership skills and experience managing research efforts or teams\n  * Previous experience in an applied R&D setting working with other Ph.D.-level research scientists\n\n","job_title":"Computer Vision Scientist","salary":"1 <span>vacancy<\/span>"},{"company":"Accenture","jd":"\n\n# The Opportunity\n\nAs a Business Intelligence pro, you'll define game-changing strategies for\nclients. You'll develop and deliver solutions that collect, transform, analyze\nand report data. And you'll provide critical knowledge and value at strategic,\ntactical and operational levels.\n\nThere will never be a typical day at Accenture Analytics, but that's why\npeople love it here. The opportunities to make a difference within exciting\nclient initiatives are unlimited in the ever-changing digital landscape.\n\n# What You Will Learn\n\n# Job Description\n\n  * Design innovative approaches to view and interact with data for analysis.\n  * Create functional requirements as input to application design while identifying the type of visualization that best suits your client's needs.\n  * Develop and test functional designs for BI, data discovery and analytics solutions.\n  * Use your tech-savvy know-how to ensure functional requirements are met.\n  * Supervise application build, test, and deploy activities.\n\n# Requirements\n\n  * Bachelor or Master degree with good Honours or equivalent or equivalent from a reputable university\n  * Ability to learn and pick up new skill fast\n\n","job_title":"Digital Data Visualisation Analyst, Accenture Digital","salary":"SGD 3000 -   (BASIC)"},{"company":"Dow Jones &amp; Company","jd":"\n\n# The Opportunity\n\nDow Jones’ Risk and Compliance business provides a comprehensive response to\nfinancial regulations by offering global, accurate, up-to-date information on\npeople and companies -- enabling customers to meet regulatory guidelines,\nperform enhanced due diligence, control money laundering and illicit payments,\nand manage risk across their business.\n\nWe are looking for talented professionals to fill the following vacancy in our\n**Singapore** office:\n\n **Research Editor, Special Interest Persons – Bahasa Melayu & Bahasa\nIndonesia \/ English**\n\nThe role of the Research Editor for Special Interest Persons – Lower Threshold\n(SIP-LT) is to research and load onto editorial interface with accurate, high-\nquality records of individuals who meet specified coverage criteria and to\nensure that volume targets are met.\n\n# What You Will Learn\n\n# Job Description\n\nBased on a set of guidelines, the Research Editor is expected to deliver the\nmost comprehensive coverage possible required for the Dow Jones Watchlist\naudience. The Research Editor is also responsible for verifying the accuracy\nof the material he\/she and other team members are adding to the database,\nincluding but limited to continual scanning and extraction from known\ninformation sources and by on-going monitoring for new sources. The Research\nEditor will also support the Desk Editor in identifying and dealing with\nquality issues and responding to client\/sales queries and support the SIP-LT\nteam in processing the addition of new data.\n\nDow Jones offers an opportunity to work for one of the world's leading\nbusiness news and information services companies. We invite interested\ncandidates to submit a cover letter and detailed resume, contact details and\ncurrent and expected salary via:\n\n[https:\/\/internationalcareers-dowjones-\nnewscorp.icims.com\/jobs\/29296\/job](https:\/\/internationalcareers-dowjones-\nnewscorp.icims.com\/jobs\/29296\/job%0d)\n\n# Requirements\n\n  * Education to degree level\n\n  * Fluency in English and Bahasa Melayu & Bahasa Indonesia, knowledge of other Asian languages such as Thai or Vietnamese is an advantage\n\n  * Research or editorial experience\n\n  * Strong knowledge of (and interest in) criminal news\n\n  * Strong research, organizational and communication skills\n\n  * Good working knowledge of Microsoft Office\n\n  * Flexible team player with a high level of initiative and self-motivation, to achieve business goals\n\n  * Able to handle large volumes of information and meet deadlines\n\n  * Excellent reading skills and eye for detail\n\n","job_title":"Research Editor, Special Interest Persons - Bahasa Melayu &amp; Bahasa Indonesia \/ English","salary":"1 <span>vacancy<\/span>"},{"company":"Accion Labs Pte Ltd","jd":"\n\n# The Opportunity\n\n# What You Will Learn\n\n# Job Description\n\nRoles are as follows: 1) Panel Data Analyst – Champion for creative and impact\nuse of paid panel in delivery\/data extraction and manipulation – panel data\nsources and MI (Kantar\/Nielsen, etc) 2) Creative Designer – Works with the\nindustrialization team to design intuitive business information dashboards\nthat are visually appealing and easy to use\/Visualization for the brands 3)\nAdvanced Analyst – With Advanced statistical methods experience; have interest\nin one of machine learning, natural language processing, artificial\nintelligence\/ Experienced with analytical tools (e.g R, SAS, Python,\ndatabases, etc) 4) Data Integrator – Mapping of internal and external data\nsources available to support analytics team and facilitate efficient use of\ndata\/Expert in all internal data sources and knows where to look to find data\nwhich can help the analysis 5) Query Writer – writes queries for Brandwatch &\nClarabridge to ensure these are the best-in-class for both quality and\nquantity standards\/queries for retrieving data and their maintenance 6) Social\nAnalyst – analysis of Social Listening\/analyze multiple data sets across\nwebsites, social media and traditional search\n\n# Requirements\n\n• Candidates with extensive experience in SQL, python and visualization tools\nwould have an advantage. • Social Listening experience is a plus\n\n","job_title":"Multiple Requirements for Data Analytics Consultants","salary":"6 <span>vacancies<\/span>"},{"company":"PT AQ Business Consulting","jd":"\n\n# The Opportunity\n\nYou can work for fast ­growing company in IT \/ Internet field You can get big\nopportunities and challenging roles if you are a quick learner and highly self\nmotivated person even though you don’t have the experience We have offices in\nJakarta, Yogyakarta and Tokyo, Malaysia.\n\n# What You Will Learn\n\n# Job Description\n\n# Requirements\n\n  1. Bachelor degree, major: IT.\n  2. Understand the concept about web based app development (web design, SEO, understand functionality in general on web based technology, such as API concept (web service), etc)\n  3. Be able in writing technical documentation and QA scenario.\n  4. Have an experience in working as QA Staff, min 1 year.\n  5. Be able to make scenario test case (web based technology in general).\n  6. Result oriented and able to work as a team\n  7. Have a good initiative and high motivation\n  8. Willing to be placed in Yogyakarta.\n\n","job_title":"Quality Assurance staff","salary":"1 <span>vacancy<\/span>"}]